/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const _SYS_TYPES_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;

pub const IPV6_PMTUDISC_DONT: u32 = 0;
pub const IPV6_PMTUDISC_WANT: u32 = 1;
pub const IPV6_PMTUDISC_DO: u32 = 2;
pub const IPV6_PMTUDISC_PROBE: u32 = 3;
pub const IPV6_PMTUDISC_INTERFACE: u32 = 4;
pub const IPV6_PMTUDISC_OMIT: u32 = 5;
pub const SOL_IPV6: u32 = 41;
pub const SOL_ICMPV6: u32 = 58;
pub const IPV6_RTHDR_LOOSE: u32 = 0;
pub const IPV6_RTHDR_STRICT: u32 = 1;
pub const IPV6_RTHDR_TYPE_0: u32 = 0;
pub const IN_CLASSA_NET: u32 = 4278190080;
pub const IN_CLASSA_NSHIFT: u32 = 24;
pub const IN_CLASSA_HOST: u32 = 16777215;
pub const IN_CLASSA_MAX: u32 = 128;
pub const IN_CLASSB_NET: u32 = 4294901760;
pub const IN_CLASSB_NSHIFT: u32 = 16;
pub const IN_CLASSB_HOST: u32 = 65535;
pub const IN_CLASSB_MAX: u32 = 65536;
pub const IN_CLASSC_NET: u32 = 4294967040;
pub const IN_CLASSC_NSHIFT: u32 = 8;
pub const IN_CLASSC_HOST: u32 = 255;
pub const IN_LOOPBACKNET: u32 = 127;
pub const INET_ADDRSTRLEN: u32 = 16;
pub const INET6_ADDRSTRLEN: u32 = 46;
pub const RSIZE_MAX: i32 = -1;
pub const ASN_PRI_SIZE: &[u8; 3] = b"zu\0";
pub const ASN_PRI_SSIZE: &[u8; 3] = b"zd\0";
pub const ASN_PRIuMAX: &[u8; 3] = b"lu\0";
pub const ASN_PRIdMAX: &[u8; 3] = b"ld\0";
pub const _ASSERT_H: u32 = 1;
pub const ASN1C_ENVIRONMENT_VERSION: u32 = 923;
pub const asn_debug_indent: u32 = 0;
pub const ASN__DEFAULT_STACK_MAX: u32 = 30000;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"][::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"][::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 0usize];
    ["Offset of field: sockaddr_storage::__ss_padding"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_padding) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 120usize];
};
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_BATCH: _bindgen_ty_1 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_1 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 56usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"][::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"][::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"][::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"][::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"][::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"][::std::mem::offset_of!(msghdr, msg_flags) - 48usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cmsghdr"][::std::mem::size_of::<cmsghdr>() - 16usize];
    ["Alignment of cmsghdr"][::std::mem::align_of::<cmsghdr>() - 8usize];
    ["Offset of field: cmsghdr::cmsg_len"][::std::mem::offset_of!(cmsghdr, cmsg_len) - 0usize];
    ["Offset of field: cmsghdr::cmsg_level"][::std::mem::offset_of!(cmsghdr, cmsg_level) - 8usize];
    ["Offset of field: cmsghdr::cmsg_type"][::std::mem::offset_of!(cmsghdr, cmsg_type) - 12usize];
    ["Offset of field: cmsghdr::__cmsg_data"]
        [::std::mem::offset_of!(cmsghdr, __cmsg_data) - 16usize];
};
unsafe extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of linger"][::std::mem::size_of::<linger>() - 8usize];
    ["Alignment of linger"][::std::mem::align_of::<linger>() - 4usize];
    ["Offset of field: linger::l_onoff"][::std::mem::offset_of!(linger, l_onoff) - 0usize];
    ["Offset of field: linger::l_linger"][::std::mem::offset_of!(linger, l_linger) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osockaddr"][::std::mem::size_of::<osockaddr>() - 16usize];
    ["Alignment of osockaddr"][::std::mem::align_of::<osockaddr>() - 2usize];
    ["Offset of field: osockaddr::sa_family"]
        [::std::mem::offset_of!(osockaddr, sa_family) - 0usize];
    ["Offset of field: osockaddr::sa_data"][::std::mem::offset_of!(osockaddr, sa_data) - 2usize];
};
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_opts"][::std::mem::size_of::<ip_opts>() - 44usize];
    ["Alignment of ip_opts"][::std::mem::align_of::<ip_opts>() - 4usize];
    ["Offset of field: ip_opts::ip_dst"][::std::mem::offset_of!(ip_opts, ip_dst) - 0usize];
    ["Offset of field: ip_opts::ip_opts"][::std::mem::offset_of!(ip_opts, ip_opts) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreqn"][::std::mem::size_of::<ip_mreqn>() - 12usize];
    ["Alignment of ip_mreqn"][::std::mem::align_of::<ip_mreqn>() - 4usize];
    ["Offset of field: ip_mreqn::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreqn, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreqn::imr_address"]
        [::std::mem::offset_of!(ip_mreqn, imr_address) - 4usize];
    ["Offset of field: ip_mreqn::imr_ifindex"]
        [::std::mem::offset_of!(ip_mreqn, imr_ifindex) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_pktinfo"][::std::mem::size_of::<in_pktinfo>() - 12usize];
    ["Alignment of in_pktinfo"][::std::mem::align_of::<in_pktinfo>() - 4usize];
    ["Offset of field: in_pktinfo::ipi_ifindex"]
        [::std::mem::offset_of!(in_pktinfo, ipi_ifindex) - 0usize];
    ["Offset of field: in_pktinfo::ipi_spec_dst"]
        [::std::mem::offset_of!(in_pktinfo, ipi_spec_dst) - 4usize];
    ["Offset of field: in_pktinfo::ipi_addr"]
        [::std::mem::offset_of!(in_pktinfo, ipi_addr) - 8usize];
};
pub const IPPROTO_IP: _bindgen_ty_4 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_4 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_4 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_4 = 4;
pub const IPPROTO_TCP: _bindgen_ty_4 = 6;
pub const IPPROTO_EGP: _bindgen_ty_4 = 8;
pub const IPPROTO_PUP: _bindgen_ty_4 = 12;
pub const IPPROTO_UDP: _bindgen_ty_4 = 17;
pub const IPPROTO_IDP: _bindgen_ty_4 = 22;
pub const IPPROTO_TP: _bindgen_ty_4 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_4 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_4 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_4 = 46;
pub const IPPROTO_GRE: _bindgen_ty_4 = 47;
pub const IPPROTO_ESP: _bindgen_ty_4 = 50;
pub const IPPROTO_AH: _bindgen_ty_4 = 51;
pub const IPPROTO_MTP: _bindgen_ty_4 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = 98;
pub const IPPROTO_PIM: _bindgen_ty_4 = 103;
pub const IPPROTO_COMP: _bindgen_ty_4 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_4 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_4 = 137;
pub const IPPROTO_ETHERNET: _bindgen_ty_4 = 143;
pub const IPPROTO_RAW: _bindgen_ty_4 = 255;
pub const IPPROTO_MPTCP: _bindgen_ty_4 = 262;
pub const IPPROTO_MAX: _bindgen_ty_4 = 263;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = 58;
pub const IPPROTO_NONE: _bindgen_ty_5 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = 60;
pub const IPPROTO_MH: _bindgen_ty_5 = 135;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_6 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_6 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_6 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_6 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_6 = 15;
pub const IPPORT_FTP: _bindgen_ty_6 = 21;
pub const IPPORT_TELNET: _bindgen_ty_6 = 23;
pub const IPPORT_SMTP: _bindgen_ty_6 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_6 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_6 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_6 = 43;
pub const IPPORT_MTP: _bindgen_ty_6 = 57;
pub const IPPORT_TFTP: _bindgen_ty_6 = 69;
pub const IPPORT_RJE: _bindgen_ty_6 = 77;
pub const IPPORT_FINGER: _bindgen_ty_6 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_6 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_6 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_6 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_6 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_6 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_6 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_6 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_6 = 5000;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"][::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
unsafe extern "C" {
    pub static in6addr_any: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"][::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq"][::std::mem::size_of::<ip_mreq>() - 8usize];
    ["Alignment of ip_mreq"][::std::mem::align_of::<ip_mreq>() - 4usize];
    ["Offset of field: ip_mreq::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq::imr_interface"]
        [::std::mem::offset_of!(ip_mreq, imr_interface) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq_source"][::std::mem::size_of::<ip_mreq_source>() - 12usize];
    ["Alignment of ip_mreq_source"][::std::mem::align_of::<ip_mreq_source>() - 4usize];
    ["Offset of field: ip_mreq_source::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq_source::imr_interface"]
        [::std::mem::offset_of!(ip_mreq_source, imr_interface) - 4usize];
    ["Offset of field: ip_mreq_source::imr_sourceaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_sourceaddr) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipv6_mreq"][::std::mem::size_of::<ipv6_mreq>() - 20usize];
    ["Alignment of ipv6_mreq"][::std::mem::align_of::<ipv6_mreq>() - 4usize];
    ["Offset of field: ipv6_mreq::ipv6mr_multiaddr"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_multiaddr) - 0usize];
    ["Offset of field: ipv6_mreq::ipv6mr_interface"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_interface) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_req"][::std::mem::size_of::<group_req>() - 136usize];
    ["Alignment of group_req"][::std::mem::align_of::<group_req>() - 8usize];
    ["Offset of field: group_req::gr_interface"]
        [::std::mem::offset_of!(group_req, gr_interface) - 0usize];
    ["Offset of field: group_req::gr_group"][::std::mem::offset_of!(group_req, gr_group) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_source_req"][::std::mem::size_of::<group_source_req>() - 264usize];
    ["Alignment of group_source_req"][::std::mem::align_of::<group_source_req>() - 8usize];
    ["Offset of field: group_source_req::gsr_interface"]
        [::std::mem::offset_of!(group_source_req, gsr_interface) - 0usize];
    ["Offset of field: group_source_req::gsr_group"]
        [::std::mem::offset_of!(group_source_req, gsr_group) - 8usize];
    ["Offset of field: group_source_req::gsr_source"]
        [::std::mem::offset_of!(group_source_req, gsr_source) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_msfilter"][::std::mem::size_of::<ip_msfilter>() - 20usize];
    ["Alignment of ip_msfilter"][::std::mem::align_of::<ip_msfilter>() - 4usize];
    ["Offset of field: ip_msfilter::imsf_multiaddr"]
        [::std::mem::offset_of!(ip_msfilter, imsf_multiaddr) - 0usize];
    ["Offset of field: ip_msfilter::imsf_interface"]
        [::std::mem::offset_of!(ip_msfilter, imsf_interface) - 4usize];
    ["Offset of field: ip_msfilter::imsf_fmode"]
        [::std::mem::offset_of!(ip_msfilter, imsf_fmode) - 8usize];
    ["Offset of field: ip_msfilter::imsf_numsrc"]
        [::std::mem::offset_of!(ip_msfilter, imsf_numsrc) - 12usize];
    ["Offset of field: ip_msfilter::imsf_slist"]
        [::std::mem::offset_of!(ip_msfilter, imsf_slist) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_filter"][::std::mem::size_of::<group_filter>() - 272usize];
    ["Alignment of group_filter"][::std::mem::align_of::<group_filter>() - 8usize];
    ["Offset of field: group_filter::gf_interface"]
        [::std::mem::offset_of!(group_filter, gf_interface) - 0usize];
    ["Offset of field: group_filter::gf_group"]
        [::std::mem::offset_of!(group_filter, gf_group) - 8usize];
    ["Offset of field: group_filter::gf_fmode"]
        [::std::mem::offset_of!(group_filter, gf_fmode) - 136usize];
    ["Offset of field: group_filter::gf_numsrc"]
        [::std::mem::offset_of!(group_filter, gf_numsrc) - 140usize];
    ["Offset of field: group_filter::gf_slist"]
        [::std::mem::offset_of!(group_filter, gf_slist) - 144usize];
};
unsafe extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_codec_ctx_s {
    pub max_stack_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_codec_ctx_s"][::std::mem::size_of::<asn_codec_ctx_s>() - 8usize];
    ["Alignment of asn_codec_ctx_s"][::std::mem::align_of::<asn_codec_ctx_s>() - 8usize];
    ["Offset of field: asn_codec_ctx_s::max_stack_size"]
        [::std::mem::offset_of!(asn_codec_ctx_s, max_stack_size) - 0usize];
};
pub type asn_codec_ctx_t = asn_codec_ctx_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_enc_rval_s {
    pub encoded: isize,
    pub failed_type: *const asn_TYPE_descriptor_s,
    pub structure_ptr: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_enc_rval_s"][::std::mem::size_of::<asn_enc_rval_s>() - 24usize];
    ["Alignment of asn_enc_rval_s"][::std::mem::align_of::<asn_enc_rval_s>() - 8usize];
    ["Offset of field: asn_enc_rval_s::encoded"]
        [::std::mem::offset_of!(asn_enc_rval_s, encoded) - 0usize];
    ["Offset of field: asn_enc_rval_s::failed_type"]
        [::std::mem::offset_of!(asn_enc_rval_s, failed_type) - 8usize];
    ["Offset of field: asn_enc_rval_s::structure_ptr"]
        [::std::mem::offset_of!(asn_enc_rval_s, structure_ptr) - 16usize];
};
pub type asn_enc_rval_t = asn_enc_rval_s;
pub const asn_dec_rval_code_e_RC_OK: asn_dec_rval_code_e = 0;
pub const asn_dec_rval_code_e_RC_WMORE: asn_dec_rval_code_e = 1;
pub const asn_dec_rval_code_e_RC_FAIL: asn_dec_rval_code_e = 2;
pub type asn_dec_rval_code_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_dec_rval_s {
    pub code: asn_dec_rval_code_e,
    pub consumed: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_dec_rval_s"][::std::mem::size_of::<asn_dec_rval_s>() - 16usize];
    ["Alignment of asn_dec_rval_s"][::std::mem::align_of::<asn_dec_rval_s>() - 8usize];
    ["Offset of field: asn_dec_rval_s::code"]
        [::std::mem::offset_of!(asn_dec_rval_s, code) - 0usize];
    ["Offset of field: asn_dec_rval_s::consumed"]
        [::std::mem::offset_of!(asn_dec_rval_s, consumed) - 8usize];
};
pub type asn_dec_rval_t = asn_dec_rval_s;
pub const asn_transfer_syntax_ATS_INVALID: asn_transfer_syntax = 0;
pub const asn_transfer_syntax_ATS_NONSTANDARD_PLAINTEXT: asn_transfer_syntax = 1;
pub const asn_transfer_syntax_ATS_RANDOM: asn_transfer_syntax = 2;
pub const asn_transfer_syntax_ATS_BER: asn_transfer_syntax = 3;
pub const asn_transfer_syntax_ATS_DER: asn_transfer_syntax = 4;
pub const asn_transfer_syntax_ATS_CER: asn_transfer_syntax = 5;
pub const asn_transfer_syntax_ATS_BASIC_OER: asn_transfer_syntax = 6;
pub const asn_transfer_syntax_ATS_CANONICAL_OER: asn_transfer_syntax = 7;
pub const asn_transfer_syntax_ATS_UNALIGNED_BASIC_PER: asn_transfer_syntax = 8;
pub const asn_transfer_syntax_ATS_UNALIGNED_CANONICAL_PER: asn_transfer_syntax = 9;
pub const asn_transfer_syntax_ATS_BASIC_XER: asn_transfer_syntax = 10;
pub const asn_transfer_syntax_ATS_CANONICAL_XER: asn_transfer_syntax = 11;
pub type asn_transfer_syntax = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn asn_encode_to_buffer(
        opt_codec_parameters: *const asn_codec_ctx_t,
        arg1: asn_transfer_syntax,
        type_to_encode: *const asn_TYPE_descriptor_s,
        structure_to_encode: *const ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_void,
        buffer_size: usize,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_encode_to_new_buffer_result_s {
    pub buffer: *mut ::std::os::raw::c_void,
    pub result: asn_enc_rval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_encode_to_new_buffer_result_s"]
        [::std::mem::size_of::<asn_encode_to_new_buffer_result_s>() - 32usize];
    ["Alignment of asn_encode_to_new_buffer_result_s"]
        [::std::mem::align_of::<asn_encode_to_new_buffer_result_s>() - 8usize];
    ["Offset of field: asn_encode_to_new_buffer_result_s::buffer"]
        [::std::mem::offset_of!(asn_encode_to_new_buffer_result_s, buffer) - 0usize];
    ["Offset of field: asn_encode_to_new_buffer_result_s::result"]
        [::std::mem::offset_of!(asn_encode_to_new_buffer_result_s, result) - 8usize];
};
pub type asn_encode_to_new_buffer_result_t = asn_encode_to_new_buffer_result_s;
unsafe extern "C" {
    pub fn asn_encode_to_new_buffer(
        opt_codec_parameters: *const asn_codec_ctx_t,
        arg1: asn_transfer_syntax,
        type_to_encode: *const asn_TYPE_descriptor_s,
        structure_to_encode: *const ::std::os::raw::c_void,
    ) -> asn_encode_to_new_buffer_result_t;
}
pub type asn_app_consume_bytes_f = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *const ::std::os::raw::c_void,
        size: usize,
        application_specific_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn asn_encode(
        opt_codec_parameters: *const asn_codec_ctx_t,
        arg1: asn_transfer_syntax,
        type_to_encode: *const asn_TYPE_descriptor_s,
        structure_to_encode: *const ::std::os::raw::c_void,
        callback: asn_app_consume_bytes_f,
        callback_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn asn_decode(
        opt_codec_parameters: *const asn_codec_ctx_t,
        arg1: asn_transfer_syntax,
        type_to_decode: *const asn_TYPE_descriptor_s,
        structure_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
pub type asn_app_constraint_failed_f = ::std::option::Option<
    unsafe extern "C" fn(
        application_specific_key: *mut ::std::os::raw::c_void,
        type_descriptor_which_failed: *const asn_TYPE_descriptor_s,
        structure_which_failed_ptr: *const ::std::os::raw::c_void,
        error_message_format: *const ::std::os::raw::c_char,
        ...
    ),
>;
pub type ber_tlv_len_t = isize;
unsafe extern "C" {
    pub fn ber_fetch_length(
        _is_constructed: ::std::os::raw::c_int,
        bufptr: *const ::std::os::raw::c_void,
        size: usize,
        len_r: *mut ber_tlv_len_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ber_skip_length(
        opt_codec_ctx: *const asn_codec_ctx_s,
        _is_constructed: ::std::os::raw::c_int,
        bufptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn der_tlv_length_serialize(
        len: ber_tlv_len_t,
        bufptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> usize;
}
pub const asn_tag_class_ASN_TAG_CLASS_UNIVERSAL: asn_tag_class = 0;
pub const asn_tag_class_ASN_TAG_CLASS_APPLICATION: asn_tag_class = 1;
pub const asn_tag_class_ASN_TAG_CLASS_CONTEXT: asn_tag_class = 2;
pub const asn_tag_class_ASN_TAG_CLASS_PRIVATE: asn_tag_class = 3;
pub type asn_tag_class = ::std::os::raw::c_uint;
pub type ber_tlv_tag_t = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn ber_tlv_tag_snprint(
        tag: ber_tlv_tag_t,
        buf: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ber_tlv_tag_fwrite(tag: ber_tlv_tag_t, arg1: *mut FILE) -> isize;
}
unsafe extern "C" {
    pub fn ber_tlv_tag_string(tag: ber_tlv_tag_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ber_fetch_tag(
        bufptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_r: *mut ber_tlv_tag_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn ber_tlv_tag_serialize(
        tag: ber_tlv_tag_t,
        bufptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_struct_ctx_s {
    pub phase: ::std::os::raw::c_short,
    pub step: ::std::os::raw::c_short,
    pub context: ::std::os::raw::c_int,
    pub ptr: *mut ::std::os::raw::c_void,
    pub left: ber_tlv_len_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_struct_ctx_s"][::std::mem::size_of::<asn_struct_ctx_s>() - 24usize];
    ["Alignment of asn_struct_ctx_s"][::std::mem::align_of::<asn_struct_ctx_s>() - 8usize];
    ["Offset of field: asn_struct_ctx_s::phase"]
        [::std::mem::offset_of!(asn_struct_ctx_s, phase) - 0usize];
    ["Offset of field: asn_struct_ctx_s::step"]
        [::std::mem::offset_of!(asn_struct_ctx_s, step) - 2usize];
    ["Offset of field: asn_struct_ctx_s::context"]
        [::std::mem::offset_of!(asn_struct_ctx_s, context) - 4usize];
    ["Offset of field: asn_struct_ctx_s::ptr"]
        [::std::mem::offset_of!(asn_struct_ctx_s, ptr) - 8usize];
    ["Offset of field: asn_struct_ctx_s::left"]
        [::std::mem::offset_of!(asn_struct_ctx_s, left) - 16usize];
};
pub type asn_struct_ctx_t = asn_struct_ctx_s;
unsafe extern "C" {
    pub fn ber_decode(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
pub type ber_type_decoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t,
>;
unsafe extern "C" {
    #[doc = " INTERNALLY USEFUL FUNCTIONS *"]
    pub fn ber_check_tags(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        opt_ctx: *mut asn_struct_ctx_t,
        ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
        last_tag_form: ::std::os::raw::c_int,
        last_length: *mut ber_tlv_len_t,
        opt_tlv_form: *mut ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn der_encode(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn der_encode_to_buffer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_void,
        buffer_size: usize,
    ) -> asn_enc_rval_t;
}
pub type der_type_encoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t,
>;
unsafe extern "C" {
    #[doc = " INTERNALLY USEFUL FUNCTIONS *"]
    pub fn der_write_tags(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_length: usize,
        tag_mode: ::std::os::raw::c_int,
        last_tag_form: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> isize;
}
unsafe extern "C" {
    pub fn xer_decode(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
pub type xer_type_decoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t,
>;
unsafe extern "C" {
    #[doc = " INTERNALLY USEFUL FUNCTIONS *"]
    pub fn xer_decode_general(
        opt_codec_ctx: *const asn_codec_ctx_t,
        ctx: *mut asn_struct_ctx_t,
        struct_key: *mut ::std::os::raw::c_void,
        xml_tag: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        opt_unexpected_tag_decoder: ::std::option::Option<
            unsafe extern "C" fn(
                struct_key: *mut ::std::os::raw::c_void,
                chunk_buf: *const ::std::os::raw::c_void,
                chunk_size: usize,
            ) -> ::std::os::raw::c_int,
        >,
        body_receiver: ::std::option::Option<
            unsafe extern "C" fn(
                struct_key: *mut ::std::os::raw::c_void,
                chunk_buf: *const ::std::os::raw::c_void,
                chunk_size: usize,
                have_more: ::std::os::raw::c_int,
            ) -> isize,
        >,
    ) -> asn_dec_rval_t;
}
pub const pxer_chunk_type_PXER_WMORE: pxer_chunk_type = 0;
pub const pxer_chunk_type_PXER_TAG: pxer_chunk_type = 1;
pub const pxer_chunk_type_PXER_TEXT: pxer_chunk_type = 2;
pub const pxer_chunk_type_PXER_COMMENT: pxer_chunk_type = 3;
pub type pxer_chunk_type = ::std::os::raw::c_uint;
pub use self::pxer_chunk_type as pxer_chunk_type_e;
unsafe extern "C" {
    pub fn xer_next_token(
        stateContext: *mut ::std::os::raw::c_int,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
        _ch_type: *mut pxer_chunk_type_e,
    ) -> isize;
}
pub const xer_check_tag_XCT_BROKEN: xer_check_tag = 0;
pub const xer_check_tag_XCT_OPENING: xer_check_tag = 1;
pub const xer_check_tag_XCT_CLOSING: xer_check_tag = 2;
pub const xer_check_tag_XCT_BOTH: xer_check_tag = 3;
pub const xer_check_tag_XCT__UNK__MASK: xer_check_tag = 4;
pub const xer_check_tag_XCT_UNKNOWN_OP: xer_check_tag = 5;
pub const xer_check_tag_XCT_UNKNOWN_CL: xer_check_tag = 6;
pub const xer_check_tag_XCT_UNKNOWN_BO: xer_check_tag = 7;
pub type xer_check_tag = ::std::os::raw::c_uint;
pub use self::xer_check_tag as xer_check_tag_e;
unsafe extern "C" {
    pub fn xer_check_tag(
        buf_ptr: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        need_tag: *const ::std::os::raw::c_char,
    ) -> xer_check_tag_e;
}
unsafe extern "C" {
    pub fn xer_whitespace_span(
        chunk_buf: *const ::std::os::raw::c_void,
        chunk_size: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn xer_skip_unknown(
        tcv: xer_check_tag_e,
        depth: *mut ber_tlv_len_t,
    ) -> ::std::os::raw::c_int;
}
pub const xer_encoder_flags_e_XER_F_BASIC: xer_encoder_flags_e = 1;
pub const xer_encoder_flags_e_XER_F_CANONICAL: xer_encoder_flags_e = 2;
pub type xer_encoder_flags_e = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn xer_encode(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn xer_fprint(
        stream: *mut FILE,
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub const xer_equivalence_e_XEQ_SUCCESS: xer_equivalence_e = 0;
pub const xer_equivalence_e_XEQ_FAILURE: xer_equivalence_e = 1;
pub const xer_equivalence_e_XEQ_ENCODE1_FAILED: xer_equivalence_e = 2;
pub const xer_equivalence_e_XEQ_ENCODE2_FAILED: xer_equivalence_e = 3;
pub const xer_equivalence_e_XEQ_DIFFERENT: xer_equivalence_e = 4;
pub const xer_equivalence_e_XEQ_DECODE_FAILED: xer_equivalence_e = 5;
pub const xer_equivalence_e_XEQ_ROUND_TRIP_FAILED: xer_equivalence_e = 6;
pub type xer_equivalence_e = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn xer_equivalent(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct1: *const ::std::os::raw::c_void,
        struct2: *const ::std::os::raw::c_void,
        opt_debug_stream: *mut FILE,
    ) -> xer_equivalence_e;
}
pub type xer_type_encoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_bit_data_s {
    pub buffer: *const u8,
    pub nboff: usize,
    pub nbits: usize,
    pub moved: usize,
    pub refill: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut asn_bit_data_s) -> ::std::os::raw::c_int,
    >,
    pub refill_key: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_bit_data_s"][::std::mem::size_of::<asn_bit_data_s>() - 48usize];
    ["Alignment of asn_bit_data_s"][::std::mem::align_of::<asn_bit_data_s>() - 8usize];
    ["Offset of field: asn_bit_data_s::buffer"]
        [::std::mem::offset_of!(asn_bit_data_s, buffer) - 0usize];
    ["Offset of field: asn_bit_data_s::nboff"]
        [::std::mem::offset_of!(asn_bit_data_s, nboff) - 8usize];
    ["Offset of field: asn_bit_data_s::nbits"]
        [::std::mem::offset_of!(asn_bit_data_s, nbits) - 16usize];
    ["Offset of field: asn_bit_data_s::moved"]
        [::std::mem::offset_of!(asn_bit_data_s, moved) - 24usize];
    ["Offset of field: asn_bit_data_s::refill"]
        [::std::mem::offset_of!(asn_bit_data_s, refill) - 32usize];
    ["Offset of field: asn_bit_data_s::refill_key"]
        [::std::mem::offset_of!(asn_bit_data_s, refill_key) - 40usize];
};
pub type asn_bit_data_t = asn_bit_data_s;
unsafe extern "C" {
    pub fn asn_bit_data_new_contiguous(
        data: *const ::std::os::raw::c_void,
        size_bits: usize,
    ) -> *mut asn_bit_data_t;
}
unsafe extern "C" {
    pub fn asn_get_few_bits(arg1: *mut asn_bit_data_t, get_nbits: ::std::os::raw::c_int) -> i32;
}
unsafe extern "C" {
    pub fn asn_get_undo(arg1: *mut asn_bit_data_t, get_nbits: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn asn_get_many_bits(
        arg1: *mut asn_bit_data_t,
        dst: *mut u8,
        right_align: ::std::os::raw::c_int,
        get_nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_bit_data_string(arg1: *mut asn_bit_data_t) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_bit_outp_s {
    pub buffer: *mut u8,
    pub nboff: usize,
    pub nbits: usize,
    pub tmpspace: [u8; 32usize],
    pub output: ::std::option::Option<
        unsafe extern "C" fn(
            data: *const ::std::os::raw::c_void,
            size: usize,
            op_key: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub op_key: *mut ::std::os::raw::c_void,
    pub flushed_bytes: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_bit_outp_s"][::std::mem::size_of::<asn_bit_outp_s>() - 80usize];
    ["Alignment of asn_bit_outp_s"][::std::mem::align_of::<asn_bit_outp_s>() - 8usize];
    ["Offset of field: asn_bit_outp_s::buffer"]
        [::std::mem::offset_of!(asn_bit_outp_s, buffer) - 0usize];
    ["Offset of field: asn_bit_outp_s::nboff"]
        [::std::mem::offset_of!(asn_bit_outp_s, nboff) - 8usize];
    ["Offset of field: asn_bit_outp_s::nbits"]
        [::std::mem::offset_of!(asn_bit_outp_s, nbits) - 16usize];
    ["Offset of field: asn_bit_outp_s::tmpspace"]
        [::std::mem::offset_of!(asn_bit_outp_s, tmpspace) - 24usize];
    ["Offset of field: asn_bit_outp_s::output"]
        [::std::mem::offset_of!(asn_bit_outp_s, output) - 56usize];
    ["Offset of field: asn_bit_outp_s::op_key"]
        [::std::mem::offset_of!(asn_bit_outp_s, op_key) - 64usize];
    ["Offset of field: asn_bit_outp_s::flushed_bytes"]
        [::std::mem::offset_of!(asn_bit_outp_s, flushed_bytes) - 72usize];
};
pub type asn_bit_outp_t = asn_bit_outp_s;
unsafe extern "C" {
    pub fn asn_put_few_bits(
        arg1: *mut asn_bit_outp_t,
        bits: u32,
        obits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_put_many_bits(
        arg1: *mut asn_bit_outp_t,
        src: *const u8,
        put_nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_put_aligned_flush(arg1: *mut asn_bit_outp_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_per_constraint_s {
    pub flags: asn_per_constraint_s_asn_per_constraint_flags,
    pub range_bits: ::std::os::raw::c_int,
    pub effective_bits: ::std::os::raw::c_int,
    pub lower_bound: ::std::os::raw::c_long,
    pub upper_bound: ::std::os::raw::c_long,
}
pub const asn_per_constraint_s_asn_per_constraint_flags_APC_UNCONSTRAINED:
    asn_per_constraint_s_asn_per_constraint_flags = 0;
pub const asn_per_constraint_s_asn_per_constraint_flags_APC_SEMI_CONSTRAINED:
    asn_per_constraint_s_asn_per_constraint_flags = 1;
pub const asn_per_constraint_s_asn_per_constraint_flags_APC_CONSTRAINED:
    asn_per_constraint_s_asn_per_constraint_flags = 2;
pub const asn_per_constraint_s_asn_per_constraint_flags_APC_EXTENSIBLE:
    asn_per_constraint_s_asn_per_constraint_flags = 4;
pub type asn_per_constraint_s_asn_per_constraint_flags = ::std::os::raw::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_per_constraint_s"][::std::mem::size_of::<asn_per_constraint_s>() - 32usize];
    ["Alignment of asn_per_constraint_s"][::std::mem::align_of::<asn_per_constraint_s>() - 8usize];
    ["Offset of field: asn_per_constraint_s::flags"]
        [::std::mem::offset_of!(asn_per_constraint_s, flags) - 0usize];
    ["Offset of field: asn_per_constraint_s::range_bits"]
        [::std::mem::offset_of!(asn_per_constraint_s, range_bits) - 4usize];
    ["Offset of field: asn_per_constraint_s::effective_bits"]
        [::std::mem::offset_of!(asn_per_constraint_s, effective_bits) - 8usize];
    ["Offset of field: asn_per_constraint_s::lower_bound"]
        [::std::mem::offset_of!(asn_per_constraint_s, lower_bound) - 16usize];
    ["Offset of field: asn_per_constraint_s::upper_bound"]
        [::std::mem::offset_of!(asn_per_constraint_s, upper_bound) - 24usize];
};
pub type asn_per_constraint_t = asn_per_constraint_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_per_constraints_s {
    pub value: asn_per_constraint_t,
    pub size: asn_per_constraint_t,
    pub value2code: ::std::option::Option<
        unsafe extern "C" fn(value: ::std::os::raw::c_uint) -> ::std::os::raw::c_int,
    >,
    pub code2value: ::std::option::Option<
        unsafe extern "C" fn(code: ::std::os::raw::c_uint) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_per_constraints_s"][::std::mem::size_of::<asn_per_constraints_s>() - 80usize];
    ["Alignment of asn_per_constraints_s"]
        [::std::mem::align_of::<asn_per_constraints_s>() - 8usize];
    ["Offset of field: asn_per_constraints_s::value"]
        [::std::mem::offset_of!(asn_per_constraints_s, value) - 0usize];
    ["Offset of field: asn_per_constraints_s::size"]
        [::std::mem::offset_of!(asn_per_constraints_s, size) - 32usize];
    ["Offset of field: asn_per_constraints_s::value2code"]
        [::std::mem::offset_of!(asn_per_constraints_s, value2code) - 64usize];
    ["Offset of field: asn_per_constraints_s::code2value"]
        [::std::mem::offset_of!(asn_per_constraints_s, code2value) - 72usize];
};
pub type asn_per_constraints_t = asn_per_constraints_s;
pub type asn_per_data_t = asn_bit_data_s;
unsafe extern "C" {
    pub fn uper_get_length(
        pd: *mut asn_per_data_t,
        effective_bound_bits: ::std::os::raw::c_int,
        lower_bound: usize,
        repeat: *mut ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn uper_get_nslength(pd: *mut asn_per_data_t) -> isize;
}
unsafe extern "C" {
    pub fn uper_get_nsnnwn(pd: *mut asn_per_data_t) -> isize;
}
unsafe extern "C" {
    pub fn uper_get_constrained_whole_number(
        pd: *mut asn_per_data_t,
        v: *mut ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type asn_per_outp_t = asn_bit_outp_s;
unsafe extern "C" {
    pub fn per_long_range_rebase(
        v: ::std::os::raw::c_long,
        lb: ::std::os::raw::c_long,
        ub: ::std::os::raw::c_long,
        output: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn per_long_range_unrebase(
        inp: ::std::os::raw::c_ulong,
        lb: ::std::os::raw::c_long,
        ub: ::std::os::raw::c_long,
        outp: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn uper_put_constrained_whole_number_u(
        po: *mut asn_per_outp_t,
        v: ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn uper_put_length(
        po: *mut asn_per_outp_t,
        whole_length: usize,
        opt_need_eom: *mut ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn uper_put_nslength(po: *mut asn_per_outp_t, length: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn uper_put_nsnnwn(
        po: *mut asn_per_outp_t,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn uper_decode_complete(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn uper_decode(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
        skip_bits: ::std::os::raw::c_int,
        unused_bits: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
pub type per_type_decoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t,
>;
unsafe extern "C" {
    pub fn uper_encode(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn uper_encode_to_buffer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_void,
        buffer_size: usize,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn uper_encode_to_new_buffer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        buffer_r: *mut *mut ::std::os::raw::c_void,
    ) -> isize;
}
pub type per_type_encoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t,
>;
unsafe extern "C" {
    pub fn asn_check_constraints(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        errbuf: *mut ::std::os::raw::c_char,
        errlen: *mut usize,
    ) -> ::std::os::raw::c_int;
}
pub type asn_constr_check_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    #[doc = " INTERNALLY USEFUL FUNCTIONS *"]
    pub fn asn_generic_no_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_generic_unknown_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_random_fill_result_s {
    pub code: asn_random_fill_result_s__bindgen_ty_1,
    pub length: usize,
}
pub const asn_random_fill_result_s_ARFILL_FAILED: asn_random_fill_result_s__bindgen_ty_1 = -1;
pub const asn_random_fill_result_s_ARFILL_OK: asn_random_fill_result_s__bindgen_ty_1 = 0;
pub const asn_random_fill_result_s_ARFILL_SKIPPED: asn_random_fill_result_s__bindgen_ty_1 = 1;
pub type asn_random_fill_result_s__bindgen_ty_1 = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_random_fill_result_s"]
        [::std::mem::size_of::<asn_random_fill_result_s>() - 16usize];
    ["Alignment of asn_random_fill_result_s"]
        [::std::mem::align_of::<asn_random_fill_result_s>() - 8usize];
    ["Offset of field: asn_random_fill_result_s::code"]
        [::std::mem::offset_of!(asn_random_fill_result_s, code) - 0usize];
    ["Offset of field: asn_random_fill_result_s::length"]
        [::std::mem::offset_of!(asn_random_fill_result_s, length) - 8usize];
};
pub type asn_random_fill_result_t = asn_random_fill_result_s;
pub type asn_random_fill_f = ::std::option::Option<
    unsafe extern "C" fn(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t,
>;
unsafe extern "C" {
    pub fn asn_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        approx_max_length_limit: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_random_between(min: intmax_t, max: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_oer_constraint_number_s {
    pub width: ::std::os::raw::c_uint,
    pub positive: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_oer_constraint_number_s"]
        [::std::mem::size_of::<asn_oer_constraint_number_s>() - 8usize];
    ["Alignment of asn_oer_constraint_number_s"]
        [::std::mem::align_of::<asn_oer_constraint_number_s>() - 4usize];
    ["Offset of field: asn_oer_constraint_number_s::width"]
        [::std::mem::offset_of!(asn_oer_constraint_number_s, width) - 0usize];
    ["Offset of field: asn_oer_constraint_number_s::positive"]
        [::std::mem::offset_of!(asn_oer_constraint_number_s, positive) - 4usize];
};
pub type asn_oer_constraint_number_t = asn_oer_constraint_number_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_oer_constraints_s {
    pub value: asn_oer_constraint_number_t,
    pub size: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_oer_constraints_s"][::std::mem::size_of::<asn_oer_constraints_s>() - 16usize];
    ["Alignment of asn_oer_constraints_s"]
        [::std::mem::align_of::<asn_oer_constraints_s>() - 8usize];
    ["Offset of field: asn_oer_constraints_s::value"]
        [::std::mem::offset_of!(asn_oer_constraints_s, value) - 0usize];
    ["Offset of field: asn_oer_constraints_s::size"]
        [::std::mem::offset_of!(asn_oer_constraints_s, size) - 8usize];
};
pub type asn_oer_constraints_t = asn_oer_constraints_s;
unsafe extern "C" {
    pub fn oer_fetch_length(
        bufptr: *const ::std::os::raw::c_void,
        size: usize,
        len_r: *mut usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn oer_serialize_length(
        length: usize,
        cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> isize;
}
unsafe extern "C" {
    pub fn oer_decode(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
pub type oer_type_decoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t,
>;
unsafe extern "C" {
    pub fn oer_open_type_skip(bufptr: *const ::std::os::raw::c_void, size: usize) -> isize;
}
unsafe extern "C" {
    pub fn oer_open_type_get(
        opt_codec_ctx: *const asn_codec_ctx_t,
        td: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        bufptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn oer_decode_primitive(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn oer_encode(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn oer_encode_to_buffer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_void,
        buffer_size: usize,
    ) -> asn_enc_rval_t;
}
pub type oer_type_encoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t,
>;
unsafe extern "C" {
    pub fn oer_open_type_put(
        td: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> isize;
}
unsafe extern "C" {
    pub fn oer_encode_primitive(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
pub const asn_struct_free_method_ASFM_FREE_EVERYTHING: asn_struct_free_method = 0;
pub const asn_struct_free_method_ASFM_FREE_UNDERLYING: asn_struct_free_method = 1;
pub const asn_struct_free_method_ASFM_FREE_UNDERLYING_AND_RESET: asn_struct_free_method = 2;
pub type asn_struct_free_method = ::std::os::raw::c_uint;
pub type asn_struct_free_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    ),
>;
pub type asn_struct_print_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type asn_struct_compare_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type asn_outmost_tag_f = ::std::option::Option<
    unsafe extern "C" fn(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
    ) -> ber_tlv_tag_t,
>;
unsafe extern "C" {
    pub fn asn_TYPE_outmost_tag(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
    ) -> ber_tlv_tag_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_type_selector_result_s {
    pub type_descriptor: *const asn_TYPE_descriptor_s,
    pub presence_index: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_type_selector_result_s"]
        [::std::mem::size_of::<asn_type_selector_result_s>() - 16usize];
    ["Alignment of asn_type_selector_result_s"]
        [::std::mem::align_of::<asn_type_selector_result_s>() - 8usize];
    ["Offset of field: asn_type_selector_result_s::type_descriptor"]
        [::std::mem::offset_of!(asn_type_selector_result_s, type_descriptor) - 0usize];
    ["Offset of field: asn_type_selector_result_s::presence_index"]
        [::std::mem::offset_of!(asn_type_selector_result_s, presence_index) - 8usize];
};
pub type asn_type_selector_result_t = asn_type_selector_result_s;
pub type asn_type_selector_f = ::std::option::Option<
    unsafe extern "C" fn(
        parent_type_descriptor: *const asn_TYPE_descriptor_s,
        parent_structure_ptr: *const ::std::os::raw::c_void,
    ) -> asn_type_selector_result_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_TYPE_operation_s {
    pub free_struct: asn_struct_free_f,
    pub print_struct: asn_struct_print_f,
    pub compare_struct: asn_struct_compare_f,
    pub ber_decoder: ber_type_decoder_f,
    pub der_encoder: der_type_encoder_f,
    pub xer_decoder: xer_type_decoder_f,
    pub xer_encoder: xer_type_encoder_f,
    pub oer_decoder: oer_type_decoder_f,
    pub oer_encoder: oer_type_encoder_f,
    pub uper_decoder: per_type_decoder_f,
    pub uper_encoder: per_type_encoder_f,
    pub random_fill: asn_random_fill_f,
    pub outmost_tag: asn_outmost_tag_f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_TYPE_operation_s"][::std::mem::size_of::<asn_TYPE_operation_s>() - 104usize];
    ["Alignment of asn_TYPE_operation_s"][::std::mem::align_of::<asn_TYPE_operation_s>() - 8usize];
    ["Offset of field: asn_TYPE_operation_s::free_struct"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, free_struct) - 0usize];
    ["Offset of field: asn_TYPE_operation_s::print_struct"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, print_struct) - 8usize];
    ["Offset of field: asn_TYPE_operation_s::compare_struct"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, compare_struct) - 16usize];
    ["Offset of field: asn_TYPE_operation_s::ber_decoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, ber_decoder) - 24usize];
    ["Offset of field: asn_TYPE_operation_s::der_encoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, der_encoder) - 32usize];
    ["Offset of field: asn_TYPE_operation_s::xer_decoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, xer_decoder) - 40usize];
    ["Offset of field: asn_TYPE_operation_s::xer_encoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, xer_encoder) - 48usize];
    ["Offset of field: asn_TYPE_operation_s::oer_decoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, oer_decoder) - 56usize];
    ["Offset of field: asn_TYPE_operation_s::oer_encoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, oer_encoder) - 64usize];
    ["Offset of field: asn_TYPE_operation_s::uper_decoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, uper_decoder) - 72usize];
    ["Offset of field: asn_TYPE_operation_s::uper_encoder"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, uper_encoder) - 80usize];
    ["Offset of field: asn_TYPE_operation_s::random_fill"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, random_fill) - 88usize];
    ["Offset of field: asn_TYPE_operation_s::outmost_tag"]
        [::std::mem::offset_of!(asn_TYPE_operation_s, outmost_tag) - 96usize];
};
pub type asn_TYPE_operation_t = asn_TYPE_operation_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_encoding_constraints_s {
    pub oer_constraints: *const asn_oer_constraints_s,
    pub per_constraints: *const asn_per_constraints_s,
    pub general_constraints: asn_constr_check_f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_encoding_constraints_s"]
        [::std::mem::size_of::<asn_encoding_constraints_s>() - 24usize];
    ["Alignment of asn_encoding_constraints_s"]
        [::std::mem::align_of::<asn_encoding_constraints_s>() - 8usize];
    ["Offset of field: asn_encoding_constraints_s::oer_constraints"]
        [::std::mem::offset_of!(asn_encoding_constraints_s, oer_constraints) - 0usize];
    ["Offset of field: asn_encoding_constraints_s::per_constraints"]
        [::std::mem::offset_of!(asn_encoding_constraints_s, per_constraints) - 8usize];
    ["Offset of field: asn_encoding_constraints_s::general_constraints"]
        [::std::mem::offset_of!(asn_encoding_constraints_s, general_constraints) - 16usize];
};
pub type asn_encoding_constraints_t = asn_encoding_constraints_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_TYPE_descriptor_s {
    pub name: *const ::std::os::raw::c_char,
    pub xml_tag: *const ::std::os::raw::c_char,
    pub op: *mut asn_TYPE_operation_t,
    #[doc = " Internally useful members. Not to be used by applications directly. *"]
    pub tags: *const ber_tlv_tag_t,
    pub tags_count: ::std::os::raw::c_uint,
    pub all_tags: *const ber_tlv_tag_t,
    pub all_tags_count: ::std::os::raw::c_uint,
    pub encoding_constraints: asn_encoding_constraints_t,
    pub elements: *mut asn_TYPE_member_s,
    pub elements_count: ::std::os::raw::c_uint,
    pub specifics: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_TYPE_descriptor_s"][::std::mem::size_of::<asn_TYPE_descriptor_s>() - 104usize];
    ["Alignment of asn_TYPE_descriptor_s"]
        [::std::mem::align_of::<asn_TYPE_descriptor_s>() - 8usize];
    ["Offset of field: asn_TYPE_descriptor_s::name"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, name) - 0usize];
    ["Offset of field: asn_TYPE_descriptor_s::xml_tag"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, xml_tag) - 8usize];
    ["Offset of field: asn_TYPE_descriptor_s::op"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, op) - 16usize];
    ["Offset of field: asn_TYPE_descriptor_s::tags"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, tags) - 24usize];
    ["Offset of field: asn_TYPE_descriptor_s::tags_count"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, tags_count) - 32usize];
    ["Offset of field: asn_TYPE_descriptor_s::all_tags"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, all_tags) - 40usize];
    ["Offset of field: asn_TYPE_descriptor_s::all_tags_count"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, all_tags_count) - 48usize];
    ["Offset of field: asn_TYPE_descriptor_s::encoding_constraints"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, encoding_constraints) - 56usize];
    ["Offset of field: asn_TYPE_descriptor_s::elements"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, elements) - 80usize];
    ["Offset of field: asn_TYPE_descriptor_s::elements_count"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, elements_count) - 88usize];
    ["Offset of field: asn_TYPE_descriptor_s::specifics"]
        [::std::mem::offset_of!(asn_TYPE_descriptor_s, specifics) - 96usize];
};
pub type asn_TYPE_descriptor_t = asn_TYPE_descriptor_s;
pub const asn_TYPE_flags_e_ATF_NOFLAGS: asn_TYPE_flags_e = 0;
pub const asn_TYPE_flags_e_ATF_POINTER: asn_TYPE_flags_e = 1;
pub const asn_TYPE_flags_e_ATF_OPEN_TYPE: asn_TYPE_flags_e = 2;
pub const asn_TYPE_flags_e_ATF_ANY_TYPE: asn_TYPE_flags_e = 4;
pub type asn_TYPE_flags_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_TYPE_member_s {
    pub flags: asn_TYPE_flags_e,
    pub optional: ::std::os::raw::c_uint,
    pub memb_offset: ::std::os::raw::c_uint,
    pub tag: ber_tlv_tag_t,
    pub tag_mode: ::std::os::raw::c_int,
    pub type_: *mut asn_TYPE_descriptor_t,
    pub type_selector: asn_type_selector_f,
    pub encoding_constraints: asn_encoding_constraints_t,
    pub default_value_cmp: ::std::option::Option<
        unsafe extern "C" fn(sptr: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub default_value_set: ::std::option::Option<
        unsafe extern "C" fn(sptr: *mut *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_TYPE_member_s"][::std::mem::size_of::<asn_TYPE_member_s>() - 88usize];
    ["Alignment of asn_TYPE_member_s"][::std::mem::align_of::<asn_TYPE_member_s>() - 8usize];
    ["Offset of field: asn_TYPE_member_s::flags"]
        [::std::mem::offset_of!(asn_TYPE_member_s, flags) - 0usize];
    ["Offset of field: asn_TYPE_member_s::optional"]
        [::std::mem::offset_of!(asn_TYPE_member_s, optional) - 4usize];
    ["Offset of field: asn_TYPE_member_s::memb_offset"]
        [::std::mem::offset_of!(asn_TYPE_member_s, memb_offset) - 8usize];
    ["Offset of field: asn_TYPE_member_s::tag"]
        [::std::mem::offset_of!(asn_TYPE_member_s, tag) - 12usize];
    ["Offset of field: asn_TYPE_member_s::tag_mode"]
        [::std::mem::offset_of!(asn_TYPE_member_s, tag_mode) - 16usize];
    ["Offset of field: asn_TYPE_member_s::type_"]
        [::std::mem::offset_of!(asn_TYPE_member_s, type_) - 24usize];
    ["Offset of field: asn_TYPE_member_s::type_selector"]
        [::std::mem::offset_of!(asn_TYPE_member_s, type_selector) - 32usize];
    ["Offset of field: asn_TYPE_member_s::encoding_constraints"]
        [::std::mem::offset_of!(asn_TYPE_member_s, encoding_constraints) - 40usize];
    ["Offset of field: asn_TYPE_member_s::default_value_cmp"]
        [::std::mem::offset_of!(asn_TYPE_member_s, default_value_cmp) - 64usize];
    ["Offset of field: asn_TYPE_member_s::default_value_set"]
        [::std::mem::offset_of!(asn_TYPE_member_s, default_value_set) - 72usize];
    ["Offset of field: asn_TYPE_member_s::name"]
        [::std::mem::offset_of!(asn_TYPE_member_s, name) - 80usize];
};
pub type asn_TYPE_member_t = asn_TYPE_member_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_TYPE_tag2member_s {
    pub el_tag: ber_tlv_tag_t,
    pub el_no: ::std::os::raw::c_uint,
    pub toff_first: ::std::os::raw::c_int,
    pub toff_last: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_TYPE_tag2member_s"][::std::mem::size_of::<asn_TYPE_tag2member_s>() - 16usize];
    ["Alignment of asn_TYPE_tag2member_s"]
        [::std::mem::align_of::<asn_TYPE_tag2member_s>() - 4usize];
    ["Offset of field: asn_TYPE_tag2member_s::el_tag"]
        [::std::mem::offset_of!(asn_TYPE_tag2member_s, el_tag) - 0usize];
    ["Offset of field: asn_TYPE_tag2member_s::el_no"]
        [::std::mem::offset_of!(asn_TYPE_tag2member_s, el_no) - 4usize];
    ["Offset of field: asn_TYPE_tag2member_s::toff_first"]
        [::std::mem::offset_of!(asn_TYPE_tag2member_s, toff_first) - 8usize];
    ["Offset of field: asn_TYPE_tag2member_s::toff_last"]
        [::std::mem::offset_of!(asn_TYPE_tag2member_s, toff_last) - 12usize];
};
pub type asn_TYPE_tag2member_t = asn_TYPE_tag2member_s;
unsafe extern "C" {
    pub fn asn_fprint(
        stream: *mut FILE,
        td: *const asn_TYPE_descriptor_t,
        struct_ptr: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Implementation of the SET OF structure."]
    pub fn asn_set_add(
        asn_set_of_x: *mut ::std::os::raw::c_void,
        ptr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_set_del(
        asn_set_of_x: *mut ::std::os::raw::c_void,
        number: ::std::os::raw::c_int,
        _do_free: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn asn_set_empty(asn_set_of_x: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_anonymous_set_ {
    pub array: *mut *mut ::std::os::raw::c_void,
    pub count: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_anonymous_set_"][::std::mem::size_of::<asn_anonymous_set_>() - 24usize];
    ["Alignment of asn_anonymous_set_"][::std::mem::align_of::<asn_anonymous_set_>() - 8usize];
    ["Offset of field: asn_anonymous_set_::array"]
        [::std::mem::offset_of!(asn_anonymous_set_, array) - 0usize];
    ["Offset of field: asn_anonymous_set_::count"]
        [::std::mem::offset_of!(asn_anonymous_set_, count) - 8usize];
    ["Offset of field: asn_anonymous_set_::size"]
        [::std::mem::offset_of!(asn_anonymous_set_, size) - 12usize];
    ["Offset of field: asn_anonymous_set_::free"]
        [::std::mem::offset_of!(asn_anonymous_set_, free) - 16usize];
};
unsafe extern "C" {
    pub fn asn_sequence_del(
        asn_sequence_of_x: *mut ::std::os::raw::c_void,
        number: ::std::os::raw::c_int,
        _do_free: ::std::os::raw::c_int,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_anonymous_sequence_ {
    pub array: *mut *mut ::std::os::raw::c_void,
    pub count: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_anonymous_sequence_"][::std::mem::size_of::<asn_anonymous_sequence_>() - 24usize];
    ["Alignment of asn_anonymous_sequence_"]
        [::std::mem::align_of::<asn_anonymous_sequence_>() - 8usize];
    ["Offset of field: asn_anonymous_sequence_::array"]
        [::std::mem::offset_of!(asn_anonymous_sequence_, array) - 0usize];
    ["Offset of field: asn_anonymous_sequence_::count"]
        [::std::mem::offset_of!(asn_anonymous_sequence_, count) - 8usize];
    ["Offset of field: asn_anonymous_sequence_::size"]
        [::std::mem::offset_of!(asn_anonymous_sequence_, size) - 12usize];
    ["Offset of field: asn_anonymous_sequence_::free"]
        [::std::mem::offset_of!(asn_anonymous_sequence_, free) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_SET_OF_specifics_s {
    pub struct_size: ::std::os::raw::c_uint,
    pub ctx_offset: ::std::os::raw::c_uint,
    pub as_XMLValueList: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_SET_OF_specifics_s"][::std::mem::size_of::<asn_SET_OF_specifics_s>() - 12usize];
    ["Alignment of asn_SET_OF_specifics_s"]
        [::std::mem::align_of::<asn_SET_OF_specifics_s>() - 4usize];
    ["Offset of field: asn_SET_OF_specifics_s::struct_size"]
        [::std::mem::offset_of!(asn_SET_OF_specifics_s, struct_size) - 0usize];
    ["Offset of field: asn_SET_OF_specifics_s::ctx_offset"]
        [::std::mem::offset_of!(asn_SET_OF_specifics_s, ctx_offset) - 4usize];
    ["Offset of field: asn_SET_OF_specifics_s::as_XMLValueList"]
        [::std::mem::offset_of!(asn_SET_OF_specifics_s, as_XMLValueList) - 8usize];
};
pub type asn_SET_OF_specifics_t = asn_SET_OF_specifics_s;
unsafe extern "C" {
    pub fn SET_OF_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn SET_OF_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SET_OF_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SET_OF_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SET_OF_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SET_OF_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    pub static mut asn_OP_SET_OF: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_OF_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SEQUENCE_OF_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_OF_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_OF_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub static mut asn_OP_SEQUENCE_OF: asn_TYPE_operation_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolIE_Field {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolIE_Container_8143P0 {
    pub list: ProtocolIE_Container_8143P0__bindgen_ty_1,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolIE_Container_8143P0__bindgen_ty_1 {
    pub array: *mut *mut ProtocolIE_Field,
    pub count: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ProtocolIE_Field)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolIE_Container_8143P0__bindgen_ty_1"]
        [::std::mem::size_of::<ProtocolIE_Container_8143P0__bindgen_ty_1>() - 24usize];
    ["Alignment of ProtocolIE_Container_8143P0__bindgen_ty_1"]
        [::std::mem::align_of::<ProtocolIE_Container_8143P0__bindgen_ty_1>() - 8usize];
    ["Offset of field: ProtocolIE_Container_8143P0__bindgen_ty_1::array"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0__bindgen_ty_1, array) - 0usize];
    ["Offset of field: ProtocolIE_Container_8143P0__bindgen_ty_1::count"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0__bindgen_ty_1, count) - 8usize];
    ["Offset of field: ProtocolIE_Container_8143P0__bindgen_ty_1::size"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0__bindgen_ty_1, size) - 12usize];
    ["Offset of field: ProtocolIE_Container_8143P0__bindgen_ty_1::free"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0__bindgen_ty_1, free) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolIE_Container_8143P0"]
        [::std::mem::size_of::<ProtocolIE_Container_8143P0>() - 48usize];
    ["Alignment of ProtocolIE_Container_8143P0"]
        [::std::mem::align_of::<ProtocolIE_Container_8143P0>() - 8usize];
    ["Offset of field: ProtocolIE_Container_8143P0::list"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0, list) - 0usize];
    ["Offset of field: ProtocolIE_Container_8143P0::_asn_ctx"]
        [::std::mem::offset_of!(ProtocolIE_Container_8143P0, _asn_ctx) - 24usize];
};
pub type ProtocolIE_Container_8143P0_t = ProtocolIE_Container_8143P0;
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolIE_Container_8143P0: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ProtocolIE_Container_8143P0_specs_1: asn_SET_OF_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ProtocolIE_Container_8143P0_1: [asn_TYPE_member_t; 1usize];
}
unsafe extern "C" {
    pub static mut asn_PER_type_ProtocolIE_Container_8143P0_constr_1: asn_per_constraints_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN__PRIMITIVE_TYPE_s {
    pub buf: *mut u8,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN__PRIMITIVE_TYPE_s"][::std::mem::size_of::<ASN__PRIMITIVE_TYPE_s>() - 16usize];
    ["Alignment of ASN__PRIMITIVE_TYPE_s"]
        [::std::mem::align_of::<ASN__PRIMITIVE_TYPE_s>() - 8usize];
    ["Offset of field: ASN__PRIMITIVE_TYPE_s::buf"]
        [::std::mem::offset_of!(ASN__PRIMITIVE_TYPE_s, buf) - 0usize];
    ["Offset of field: ASN__PRIMITIVE_TYPE_s::size"]
        [::std::mem::offset_of!(ASN__PRIMITIVE_TYPE_s, size) - 8usize];
};
pub type ASN__PRIMITIVE_TYPE_t = ASN__PRIMITIVE_TYPE_s;
unsafe extern "C" {
    pub fn ASN__PRIMITIVE_TYPE_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn ber_decode_primitive(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn der_encode_primitive(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
pub const xer_pbd_rval_XPBD_SYSTEM_FAILURE: xer_pbd_rval = 0;
pub const xer_pbd_rval_XPBD_DECODER_LIMIT: xer_pbd_rval = 1;
pub const xer_pbd_rval_XPBD_BROKEN_ENCODING: xer_pbd_rval = 2;
pub const xer_pbd_rval_XPBD_NOT_BODY_IGNORE: xer_pbd_rval = 3;
pub const xer_pbd_rval_XPBD_BODY_CONSUMED: xer_pbd_rval = 4;
pub type xer_pbd_rval = ::std::os::raw::c_uint;
pub type xer_primitive_body_decoder_f = ::std::option::Option<
    unsafe extern "C" fn(
        td: *const asn_TYPE_descriptor_t,
        struct_ptr: *mut ::std::os::raw::c_void,
        chunk_buf: *const ::std::os::raw::c_void,
        chunk_size: usize,
    ) -> xer_pbd_rval,
>;
unsafe extern "C" {
    pub fn xer_decode_primitive(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        struct_size: usize,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        prim_body_decoder: xer_primitive_body_decoder_f,
    ) -> asn_dec_rval_t;
}
pub type INTEGER_t = ASN__PRIMITIVE_TYPE_t;
unsafe extern "C" {
    pub static mut asn_DEF_INTEGER: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_INTEGER: asn_TYPE_operation_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_INTEGER_enum_map_s {
    pub nat_value: ::std::os::raw::c_long,
    pub enum_len: usize,
    pub enum_name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_INTEGER_enum_map_s"][::std::mem::size_of::<asn_INTEGER_enum_map_s>() - 24usize];
    ["Alignment of asn_INTEGER_enum_map_s"]
        [::std::mem::align_of::<asn_INTEGER_enum_map_s>() - 8usize];
    ["Offset of field: asn_INTEGER_enum_map_s::nat_value"]
        [::std::mem::offset_of!(asn_INTEGER_enum_map_s, nat_value) - 0usize];
    ["Offset of field: asn_INTEGER_enum_map_s::enum_len"]
        [::std::mem::offset_of!(asn_INTEGER_enum_map_s, enum_len) - 8usize];
    ["Offset of field: asn_INTEGER_enum_map_s::enum_name"]
        [::std::mem::offset_of!(asn_INTEGER_enum_map_s, enum_name) - 16usize];
};
pub type asn_INTEGER_enum_map_t = asn_INTEGER_enum_map_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_INTEGER_specifics_s {
    pub value2enum: *const asn_INTEGER_enum_map_t,
    pub enum2value: *const ::std::os::raw::c_uint,
    pub map_count: ::std::os::raw::c_int,
    pub extension: ::std::os::raw::c_int,
    pub strict_enumeration: ::std::os::raw::c_int,
    pub field_width: ::std::os::raw::c_int,
    pub field_unsigned: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_INTEGER_specifics_s"][::std::mem::size_of::<asn_INTEGER_specifics_s>() - 40usize];
    ["Alignment of asn_INTEGER_specifics_s"]
        [::std::mem::align_of::<asn_INTEGER_specifics_s>() - 8usize];
    ["Offset of field: asn_INTEGER_specifics_s::value2enum"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, value2enum) - 0usize];
    ["Offset of field: asn_INTEGER_specifics_s::enum2value"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, enum2value) - 8usize];
    ["Offset of field: asn_INTEGER_specifics_s::map_count"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, map_count) - 16usize];
    ["Offset of field: asn_INTEGER_specifics_s::extension"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, extension) - 20usize];
    ["Offset of field: asn_INTEGER_specifics_s::strict_enumeration"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, strict_enumeration) - 24usize];
    ["Offset of field: asn_INTEGER_specifics_s::field_width"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, field_width) - 28usize];
    ["Offset of field: asn_INTEGER_specifics_s::field_unsigned"]
        [::std::mem::offset_of!(asn_INTEGER_specifics_s, field_unsigned) - 32usize];
};
pub type asn_INTEGER_specifics_t = asn_INTEGER_specifics_s;
unsafe extern "C" {
    pub fn INTEGER_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn INTEGER_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn INTEGER_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn INTEGER_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    #[doc = " Some handy conversion routines. *"]
    pub fn asn_INTEGER2imax(i: *const INTEGER_t, l: *mut intmax_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_INTEGER2umax(i: *const INTEGER_t, l: *mut uintmax_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_imax2INTEGER(i: *mut INTEGER_t, l: intmax_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_umax2INTEGER(i: *mut INTEGER_t, l: uintmax_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_INTEGER2long(
        i: *const INTEGER_t,
        l: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_INTEGER2ulong(
        i: *const INTEGER_t,
        l: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_long2INTEGER(i: *mut INTEGER_t, l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn_ulong2INTEGER(
        i: *mut INTEGER_t,
        l: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
pub const asn_strtox_result_e_ASN_STRTOX_ERROR_RANGE: asn_strtox_result_e = -3;
pub const asn_strtox_result_e_ASN_STRTOX_ERROR_INVAL: asn_strtox_result_e = -2;
pub const asn_strtox_result_e_ASN_STRTOX_EXPECT_MORE: asn_strtox_result_e = -1;
pub const asn_strtox_result_e_ASN_STRTOX_OK: asn_strtox_result_e = 0;
pub const asn_strtox_result_e_ASN_STRTOX_EXTRA_DATA: asn_strtox_result_e = 1;
pub type asn_strtox_result_e = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn asn_strtol_lim(
        str_: *const ::std::os::raw::c_char,
        end: *mut *const ::std::os::raw::c_char,
        l: *mut ::std::os::raw::c_long,
    ) -> asn_strtox_result_e;
}
unsafe extern "C" {
    pub fn asn_strtoul_lim(
        str_: *const ::std::os::raw::c_char,
        end: *mut *const ::std::os::raw::c_char,
        l: *mut ::std::os::raw::c_ulong,
    ) -> asn_strtox_result_e;
}
unsafe extern "C" {
    pub fn asn_strtoimax_lim(
        str_: *const ::std::os::raw::c_char,
        end: *mut *const ::std::os::raw::c_char,
        l: *mut intmax_t,
    ) -> asn_strtox_result_e;
}
unsafe extern "C" {
    pub fn asn_strtoumax_lim(
        str_: *const ::std::os::raw::c_char,
        end: *mut *const ::std::os::raw::c_char,
        l: *mut uintmax_t,
    ) -> asn_strtox_result_e;
}
unsafe extern "C" {
    pub fn INTEGER_map_value2enum(
        specs: *const asn_INTEGER_specifics_t,
        value: ::std::os::raw::c_long,
    ) -> *const asn_INTEGER_enum_map_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_NativeInteger: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_NativeInteger: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn NativeInteger_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn NativeInteger_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn NativeInteger_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn NativeInteger_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeInteger_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
pub type ProtocolIE_ID_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_ProtocolIE_ID_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolIE_ID: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolIE_ID_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn __assert_fail(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn __assert_perror_fail(
        __errnum: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_uint,
        __function: *const ::std::os::raw::c_char,
    ) -> !;
}
unsafe extern "C" {
    pub fn __assert(
        __assertion: *const ::std::os::raw::c_char,
        __file: *const ::std::os::raw::c_char,
        __line: ::std::os::raw::c_int,
    ) -> !;
}
unsafe extern "C" {
    pub fn get_asn1c_environment_version() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asn__format_to_callback(
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: usize,
                key: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        key: *mut ::std::os::raw::c_void,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> isize;
}
unsafe extern "C" {
    pub static mut asn_DEF_NativeEnumerated: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_NativeEnumerated: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn NativeEnumerated_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeEnumerated_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeEnumerated_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NativeEnumerated_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NativeEnumerated_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub const Criticality_Criticality_reject: Criticality = 0;
pub const Criticality_Criticality_ignore: Criticality = 1;
pub const Criticality_Criticality_notify: Criticality = 2;
pub type Criticality = ::std::os::raw::c_uint;
pub use self::Criticality as e_Criticality;
pub type Criticality_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_Criticality_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_Criticality: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static asn_SPC_Criticality_specs_1: asn_INTEGER_specifics_t;
}
unsafe extern "C" {
    pub fn Criticality_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn Criticality_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Criticality_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Criticality_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn Criticality_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OCTET_STRING {
    pub buf: *mut u8,
    pub size: usize,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OCTET_STRING"][::std::mem::size_of::<OCTET_STRING>() - 40usize];
    ["Alignment of OCTET_STRING"][::std::mem::align_of::<OCTET_STRING>() - 8usize];
    ["Offset of field: OCTET_STRING::buf"][::std::mem::offset_of!(OCTET_STRING, buf) - 0usize];
    ["Offset of field: OCTET_STRING::size"][::std::mem::offset_of!(OCTET_STRING, size) - 8usize];
    ["Offset of field: OCTET_STRING::_asn_ctx"]
        [::std::mem::offset_of!(OCTET_STRING, _asn_ctx) - 16usize];
};
pub type OCTET_STRING_t = OCTET_STRING;
unsafe extern "C" {
    pub static mut asn_DEF_OCTET_STRING: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_OCTET_STRING: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn OCTET_STRING_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OCTET_STRING_print_utf8(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OCTET_STRING_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_xer_hex(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_xer_binary(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_xer_utf8(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_encode_xer_utf8(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    #[doc = " Handy conversion routines. *"]
    pub fn OCTET_STRING_fromBuf(
        s: *mut OCTET_STRING_t,
        str_: *const ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OCTET_STRING_new_fromBuf(
        td: *const asn_TYPE_descriptor_t,
        str_: *const ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> *mut OCTET_STRING_t;
}
#[doc = " Internally useful stuff. *"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_OCTET_STRING_specifics_s {
    pub struct_size: ::std::os::raw::c_uint,
    pub ctx_offset: ::std::os::raw::c_uint,
    pub subvariant: asn_OCTET_STRING_specifics_s_asn_OS_Subvariant,
}
pub const asn_OCTET_STRING_specifics_s_asn_OS_Subvariant_ASN_OSUBV_ANY:
    asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = 0;
pub const asn_OCTET_STRING_specifics_s_asn_OS_Subvariant_ASN_OSUBV_BIT:
    asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = 1;
pub const asn_OCTET_STRING_specifics_s_asn_OS_Subvariant_ASN_OSUBV_STR:
    asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = 2;
pub const asn_OCTET_STRING_specifics_s_asn_OS_Subvariant_ASN_OSUBV_U16:
    asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = 3;
pub const asn_OCTET_STRING_specifics_s_asn_OS_Subvariant_ASN_OSUBV_U32:
    asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = 4;
pub type asn_OCTET_STRING_specifics_s_asn_OS_Subvariant = ::std::os::raw::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_OCTET_STRING_specifics_s"]
        [::std::mem::size_of::<asn_OCTET_STRING_specifics_s>() - 12usize];
    ["Alignment of asn_OCTET_STRING_specifics_s"]
        [::std::mem::align_of::<asn_OCTET_STRING_specifics_s>() - 4usize];
    ["Offset of field: asn_OCTET_STRING_specifics_s::struct_size"]
        [::std::mem::offset_of!(asn_OCTET_STRING_specifics_s, struct_size) - 0usize];
    ["Offset of field: asn_OCTET_STRING_specifics_s::ctx_offset"]
        [::std::mem::offset_of!(asn_OCTET_STRING_specifics_s, ctx_offset) - 4usize];
    ["Offset of field: asn_OCTET_STRING_specifics_s::subvariant"]
        [::std::mem::offset_of!(asn_OCTET_STRING_specifics_s, subvariant) - 8usize];
};
#[doc = " Internally useful stuff. *"]
pub type asn_OCTET_STRING_specifics_t = asn_OCTET_STRING_specifics_s;
unsafe extern "C" {
    pub static mut asn_SPC_OCTET_STRING_specs: asn_OCTET_STRING_specifics_t;
}
unsafe extern "C" {
    pub fn OCTET_STRING_random_length_constrained(
        arg1: *const asn_TYPE_descriptor_t,
        arg2: *const asn_encoding_constraints_t,
        max_length: usize,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ANY {
    pub buf: *mut u8,
    pub size: ::std::os::raw::c_int,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ANY"][::std::mem::size_of::<ANY>() - 40usize];
    ["Alignment of ANY"][::std::mem::align_of::<ANY>() - 8usize];
    ["Offset of field: ANY::buf"][::std::mem::offset_of!(ANY, buf) - 0usize];
    ["Offset of field: ANY::size"][::std::mem::offset_of!(ANY, size) - 8usize];
    ["Offset of field: ANY::_asn_ctx"][::std::mem::offset_of!(ANY, _asn_ctx) - 16usize];
};
pub type ANY_t = ANY;
unsafe extern "C" {
    pub static mut asn_DEF_ANY: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_ANY: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ANY_specs: asn_OCTET_STRING_specifics_t;
}
unsafe extern "C" {
    pub fn ANY_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn ANY_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ANY_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ANY_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ANY_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ANY_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ANY_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    #[doc = " Handy conversion routines. *"]
    pub fn ANY_fromType(
        arg1: *mut ANY_t,
        td: *mut asn_TYPE_descriptor_t,
        struct_ptr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ANY_new_fromType(
        td: *mut asn_TYPE_descriptor_t,
        struct_ptr: *mut ::std::os::raw::c_void,
    ) -> *mut ANY_t;
}
unsafe extern "C" {
    pub fn ANY_to_type(
        arg1: *mut ANY_t,
        td: *mut asn_TYPE_descriptor_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_ioc_set_s {
    pub rows_count: usize,
    pub columns_count: usize,
    pub rows: *const asn_ioc_cell_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_ioc_set_s"][::std::mem::size_of::<asn_ioc_set_s>() - 24usize];
    ["Alignment of asn_ioc_set_s"][::std::mem::align_of::<asn_ioc_set_s>() - 8usize];
    ["Offset of field: asn_ioc_set_s::rows_count"]
        [::std::mem::offset_of!(asn_ioc_set_s, rows_count) - 0usize];
    ["Offset of field: asn_ioc_set_s::columns_count"]
        [::std::mem::offset_of!(asn_ioc_set_s, columns_count) - 8usize];
    ["Offset of field: asn_ioc_set_s::rows"][::std::mem::offset_of!(asn_ioc_set_s, rows) - 16usize];
};
pub type asn_ioc_set_t = asn_ioc_set_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_ioc_cell_s {
    pub field_name: *const ::std::os::raw::c_char,
    pub cell_kind: asn_ioc_cell_s__bindgen_ty_1,
    pub type_descriptor: *mut asn_TYPE_descriptor_s,
    pub value_sptr: *const ::std::os::raw::c_void,
    pub open_type: asn_ioc_cell_s__bindgen_ty_2,
}
pub const asn_ioc_cell_s_aioc__value: asn_ioc_cell_s__bindgen_ty_1 = 0;
pub const asn_ioc_cell_s_aioc__type: asn_ioc_cell_s__bindgen_ty_1 = 1;
pub const asn_ioc_cell_s_aioc__open_type: asn_ioc_cell_s__bindgen_ty_1 = 2;
pub type asn_ioc_cell_s__bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_ioc_cell_s__bindgen_ty_2 {
    pub types_count: usize,
    pub types: *mut asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1 {
    pub choice_position: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Alignment of asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1::choice_position"][::std::mem::offset_of!(
        asn_ioc_cell_s__bindgen_ty_2__bindgen_ty_1,
        choice_position
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_ioc_cell_s__bindgen_ty_2"]
        [::std::mem::size_of::<asn_ioc_cell_s__bindgen_ty_2>() - 16usize];
    ["Alignment of asn_ioc_cell_s__bindgen_ty_2"]
        [::std::mem::align_of::<asn_ioc_cell_s__bindgen_ty_2>() - 8usize];
    ["Offset of field: asn_ioc_cell_s__bindgen_ty_2::types_count"]
        [::std::mem::offset_of!(asn_ioc_cell_s__bindgen_ty_2, types_count) - 0usize];
    ["Offset of field: asn_ioc_cell_s__bindgen_ty_2::types"]
        [::std::mem::offset_of!(asn_ioc_cell_s__bindgen_ty_2, types) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_ioc_cell_s"][::std::mem::size_of::<asn_ioc_cell_s>() - 48usize];
    ["Alignment of asn_ioc_cell_s"][::std::mem::align_of::<asn_ioc_cell_s>() - 8usize];
    ["Offset of field: asn_ioc_cell_s::field_name"]
        [::std::mem::offset_of!(asn_ioc_cell_s, field_name) - 0usize];
    ["Offset of field: asn_ioc_cell_s::cell_kind"]
        [::std::mem::offset_of!(asn_ioc_cell_s, cell_kind) - 8usize];
    ["Offset of field: asn_ioc_cell_s::type_descriptor"]
        [::std::mem::offset_of!(asn_ioc_cell_s, type_descriptor) - 16usize];
    ["Offset of field: asn_ioc_cell_s::value_sptr"]
        [::std::mem::offset_of!(asn_ioc_cell_s, value_sptr) - 24usize];
    ["Offset of field: asn_ioc_cell_s::open_type"]
        [::std::mem::offset_of!(asn_ioc_cell_s, open_type) - 32usize];
};
pub type asn_ioc_cell_t = asn_ioc_cell_s;
unsafe extern "C" {
    pub static mut asn_OP_OPEN_TYPE: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn OPEN_TYPE_ber_get(
        opt_codec_ctx: *const asn_codec_ctx_t,
        parent_type: *const asn_TYPE_descriptor_t,
        parent_structure: *mut ::std::os::raw::c_void,
        element: *const asn_TYPE_member_t,
        ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OPEN_TYPE_xer_get(
        opt_codec_ctx: *const asn_codec_ctx_t,
        parent_type: *const asn_TYPE_descriptor_t,
        parent_structure: *mut ::std::os::raw::c_void,
        element: *const asn_TYPE_member_t,
        ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OPEN_TYPE_oer_get(
        opt_codec_ctx: *const asn_codec_ctx_t,
        parent_type: *const asn_TYPE_descriptor_t,
        parent_structure: *mut ::std::os::raw::c_void,
        element: *mut asn_TYPE_member_t,
        ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OPEN_TYPE_uper_get(
        opt_codec_ctx: *const asn_codec_ctx_t,
        parent_type: *const asn_TYPE_descriptor_t,
        parent_structure: *mut ::std::os::raw::c_void,
        element: *const asn_TYPE_member_t,
        pd: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OPEN_TYPE_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_t,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_CHOICE_specifics_s {
    pub struct_size: ::std::os::raw::c_uint,
    pub ctx_offset: ::std::os::raw::c_uint,
    pub pres_offset: ::std::os::raw::c_uint,
    pub pres_size: ::std::os::raw::c_uint,
    pub tag2el: *const asn_TYPE_tag2member_t,
    pub tag2el_count: ::std::os::raw::c_uint,
    pub to_canonical_order: *const ::std::os::raw::c_uint,
    pub from_canonical_order: *const ::std::os::raw::c_uint,
    pub ext_start: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_CHOICE_specifics_s"][::std::mem::size_of::<asn_CHOICE_specifics_s>() - 56usize];
    ["Alignment of asn_CHOICE_specifics_s"]
        [::std::mem::align_of::<asn_CHOICE_specifics_s>() - 8usize];
    ["Offset of field: asn_CHOICE_specifics_s::struct_size"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, struct_size) - 0usize];
    ["Offset of field: asn_CHOICE_specifics_s::ctx_offset"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, ctx_offset) - 4usize];
    ["Offset of field: asn_CHOICE_specifics_s::pres_offset"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, pres_offset) - 8usize];
    ["Offset of field: asn_CHOICE_specifics_s::pres_size"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, pres_size) - 12usize];
    ["Offset of field: asn_CHOICE_specifics_s::tag2el"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, tag2el) - 16usize];
    ["Offset of field: asn_CHOICE_specifics_s::tag2el_count"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, tag2el_count) - 24usize];
    ["Offset of field: asn_CHOICE_specifics_s::to_canonical_order"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, to_canonical_order) - 32usize];
    ["Offset of field: asn_CHOICE_specifics_s::from_canonical_order"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, from_canonical_order) - 40usize];
    ["Offset of field: asn_CHOICE_specifics_s::ext_start"]
        [::std::mem::offset_of!(asn_CHOICE_specifics_s, ext_start) - 48usize];
};
pub type asn_CHOICE_specifics_t = asn_CHOICE_specifics_s;
unsafe extern "C" {
    pub fn CHOICE_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn CHOICE_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CHOICE_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CHOICE_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CHOICE_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CHOICE_outmost_tag(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
    ) -> ber_tlv_tag_t;
}
unsafe extern "C" {
    pub fn CHOICE_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    pub static mut asn_OP_CHOICE: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn CHOICE_variant_get_presence(
        td: *const asn_TYPE_descriptor_t,
        structure_ptr: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn CHOICE_variant_set_presence(
        td: *const asn_TYPE_descriptor_t,
        structure_ptr: *mut ::std::os::raw::c_void,
        present: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn_SEQUENCE_specifics_s {
    pub struct_size: ::std::os::raw::c_uint,
    pub ctx_offset: ::std::os::raw::c_uint,
    pub tag2el: *const asn_TYPE_tag2member_t,
    pub tag2el_count: ::std::os::raw::c_uint,
    pub oms: *const ::std::os::raw::c_int,
    pub roms_count: ::std::os::raw::c_uint,
    pub aoms_count: ::std::os::raw::c_uint,
    pub first_extension: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn_SEQUENCE_specifics_s"]
        [::std::mem::size_of::<asn_SEQUENCE_specifics_s>() - 48usize];
    ["Alignment of asn_SEQUENCE_specifics_s"]
        [::std::mem::align_of::<asn_SEQUENCE_specifics_s>() - 8usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::struct_size"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, struct_size) - 0usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::ctx_offset"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, ctx_offset) - 4usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::tag2el"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, tag2el) - 8usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::tag2el_count"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, tag2el_count) - 16usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::oms"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, oms) - 24usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::roms_count"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, roms_count) - 32usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::aoms_count"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, aoms_count) - 36usize];
    ["Offset of field: asn_SEQUENCE_specifics_s::first_extension"]
        [::std::mem::offset_of!(asn_SEQUENCE_specifics_s, first_extension) - 40usize];
};
pub type asn_SEQUENCE_specifics_t = asn_SEQUENCE_specifics_s;
unsafe extern "C" {
    pub fn SEQUENCE_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn SEQUENCE_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SEQUENCE_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SEQUENCE_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SEQUENCE_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn SEQUENCE_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    pub static mut asn_OP_SEQUENCE: asn_TYPE_operation_t;
}
pub const ProtocolIE_Field_8149P0__value_PR_ProtocolIE_Field_8149P0__value_PR_NOTHING:
    ProtocolIE_Field_8149P0__value_PR = 0;
pub type ProtocolIE_Field_8149P0__value_PR = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ProtocolIE_Field_8149P0 {
    pub id: ProtocolIE_ID_t,
    pub criticality: Criticality_t,
    pub value: ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value {
    pub present: ProtocolIE_Field_8149P0__value_PR,
    pub choice:
        ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Copy, Clone)]
pub struct ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u {
    pub bindgen_union_field: [u8; 0usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u"] [:: std :: mem :: size_of :: < ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u > () - 0usize] ;
    ["Alignment of ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u"] [:: std :: mem :: align_of :: < ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value_ProtocolIE_Field_8149P0__value_u > () - 1usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value"]
        [::std::mem::size_of::<ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value>() - 32usize];
    ["Alignment of ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value"]
        [::std::mem::align_of::<ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value>() - 8usize];
    ["Offset of field: ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value::present"][::std::mem::offset_of!(
        ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value,
        present
    )
        - 0usize];
    ["Offset of field: ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value::choice"][::std::mem::offset_of!(
        ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value,
        choice
    ) - 4usize];
    ["Offset of field: ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value::_asn_ctx"][::std::mem::offset_of!(
        ProtocolIE_Field_8149P0_ProtocolIE_Field_8149P0__value,
        _asn_ctx
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolIE_Field_8149P0"][::std::mem::size_of::<ProtocolIE_Field_8149P0>() - 72usize];
    ["Alignment of ProtocolIE_Field_8149P0"]
        [::std::mem::align_of::<ProtocolIE_Field_8149P0>() - 8usize];
    ["Offset of field: ProtocolIE_Field_8149P0::id"]
        [::std::mem::offset_of!(ProtocolIE_Field_8149P0, id) - 0usize];
    ["Offset of field: ProtocolIE_Field_8149P0::criticality"]
        [::std::mem::offset_of!(ProtocolIE_Field_8149P0, criticality) - 8usize];
    ["Offset of field: ProtocolIE_Field_8149P0::value"]
        [::std::mem::offset_of!(ProtocolIE_Field_8149P0, value) - 16usize];
    ["Offset of field: ProtocolIE_Field_8149P0::_asn_ctx"]
        [::std::mem::offset_of!(ProtocolIE_Field_8149P0, _asn_ctx) - 48usize];
};
pub type ProtocolIE_Field_8149P0_t = ProtocolIE_Field_8149P0;
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolIE_Field_8149P0: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ProtocolIE_Field_8149P0_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ProtocolIE_Field_8149P0_1: [asn_TYPE_member_t; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UplinkS1cdma2000tunnelling {
    pub protocolIEs: ProtocolIE_Container_8143P0_t,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UplinkS1cdma2000tunnelling"]
        [::std::mem::size_of::<UplinkS1cdma2000tunnelling>() - 72usize];
    ["Alignment of UplinkS1cdma2000tunnelling"]
        [::std::mem::align_of::<UplinkS1cdma2000tunnelling>() - 8usize];
    ["Offset of field: UplinkS1cdma2000tunnelling::protocolIEs"]
        [::std::mem::offset_of!(UplinkS1cdma2000tunnelling, protocolIEs) - 0usize];
    ["Offset of field: UplinkS1cdma2000tunnelling::_asn_ctx"]
        [::std::mem::offset_of!(UplinkS1cdma2000tunnelling, _asn_ctx) - 48usize];
};
pub type UplinkS1cdma2000tunnelling_t = UplinkS1cdma2000tunnelling;
unsafe extern "C" {
    pub static mut asn_DEF_UplinkS1cdma2000tunnelling: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_UplinkS1cdma2000tunnelling_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_UplinkS1cdma2000tunnelling_1: [asn_TYPE_member_t; 1usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ErrorIndication {
    pub protocolIEs: ProtocolIE_Container_8143P0_t,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ErrorIndication"][::std::mem::size_of::<ErrorIndication>() - 72usize];
    ["Alignment of ErrorIndication"][::std::mem::align_of::<ErrorIndication>() - 8usize];
    ["Offset of field: ErrorIndication::protocolIEs"]
        [::std::mem::offset_of!(ErrorIndication, protocolIEs) - 0usize];
    ["Offset of field: ErrorIndication::_asn_ctx"]
        [::std::mem::offset_of!(ErrorIndication, _asn_ctx) - 48usize];
};
pub type ErrorIndication_t = ErrorIndication;
unsafe extern "C" {
    pub static mut asn_DEF_ErrorIndication: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ErrorIndication_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ErrorIndication_1: [asn_TYPE_member_t; 1usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ENBConfigurationTransfer {
    pub protocolIEs: ProtocolIE_Container_8143P0_t,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ENBConfigurationTransfer"]
        [::std::mem::size_of::<ENBConfigurationTransfer>() - 72usize];
    ["Alignment of ENBConfigurationTransfer"]
        [::std::mem::align_of::<ENBConfigurationTransfer>() - 8usize];
    ["Offset of field: ENBConfigurationTransfer::protocolIEs"]
        [::std::mem::offset_of!(ENBConfigurationTransfer, protocolIEs) - 0usize];
    ["Offset of field: ENBConfigurationTransfer::_asn_ctx"]
        [::std::mem::offset_of!(ENBConfigurationTransfer, _asn_ctx) - 48usize];
};
pub type ENBConfigurationTransfer_t = ENBConfigurationTransfer;
unsafe extern "C" {
    pub static mut asn_DEF_ENBConfigurationTransfer: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ENBConfigurationTransfer_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ENBConfigurationTransfer_1: [asn_TYPE_member_t; 1usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ENBStatusTransfer {
    pub protocolIEs: ProtocolIE_Container_8143P0_t,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ENBStatusTransfer"][::std::mem::size_of::<ENBStatusTransfer>() - 72usize];
    ["Alignment of ENBStatusTransfer"][::std::mem::align_of::<ENBStatusTransfer>() - 8usize];
    ["Offset of field: ENBStatusTransfer::protocolIEs"]
        [::std::mem::offset_of!(ENBStatusTransfer, protocolIEs) - 0usize];
    ["Offset of field: ENBStatusTransfer::_asn_ctx"]
        [::std::mem::offset_of!(ENBStatusTransfer, _asn_ctx) - 48usize];
};
pub type ENBStatusTransfer_t = ENBStatusTransfer;
unsafe extern "C" {
    pub static mut asn_DEF_ENBStatusTransfer: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ENBStatusTransfer_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ENBStatusTransfer_1: [asn_TYPE_member_t; 1usize];
}
pub type asn_oid_arc_t = u32;
pub type OBJECT_IDENTIFIER_t = ASN__PRIMITIVE_TYPE_t;
unsafe extern "C" {
    pub static mut asn_DEF_OBJECT_IDENTIFIER: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_OBJECT_IDENTIFIER: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_get_arcs(
        oid: *const OBJECT_IDENTIFIER_t,
        arcs: *mut asn_oid_arc_t,
        arc_slots: usize,
    ) -> isize;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_set_arcs(
        oid: *mut OBJECT_IDENTIFIER_t,
        arcs: *const asn_oid_arc_t,
        arcs_count: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_parse_arcs(
        oid_text: *const ::std::os::raw::c_char,
        oid_txt_length: isize,
        arcs: *mut asn_oid_arc_t,
        arcs_count: usize,
        opt_oid_text_end: *mut *const ::std::os::raw::c_char,
    ) -> isize;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_get_single_arc(
        arcbuf: *const u8,
        arcbuf_len: usize,
        ret_value: *mut asn_oid_arc_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn OBJECT_IDENTIFIER_set_single_arc(
        arcbuf: *mut u8,
        arcbuf_len: usize,
        arc_value: asn_oid_arc_t,
    ) -> isize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HandoverRequestAcknowledge {
    pub protocolIEs: ProtocolIE_Container_8143P0_t,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HandoverRequestAcknowledge"]
        [::std::mem::size_of::<HandoverRequestAcknowledge>() - 72usize];
    ["Alignment of HandoverRequestAcknowledge"]
        [::std::mem::align_of::<HandoverRequestAcknowledge>() - 8usize];
    ["Offset of field: HandoverRequestAcknowledge::protocolIEs"]
        [::std::mem::offset_of!(HandoverRequestAcknowledge, protocolIEs) - 0usize];
    ["Offset of field: HandoverRequestAcknowledge::_asn_ctx"]
        [::std::mem::offset_of!(HandoverRequestAcknowledge, _asn_ctx) - 48usize];
};
pub type HandoverRequestAcknowledge_t = HandoverRequestAcknowledge;
unsafe extern "C" {
    pub static mut asn_DEF_HandoverRequestAcknowledge: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_HandoverRequestAcknowledge_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_HandoverRequestAcknowledge_1: [asn_TYPE_member_t; 1usize];
}
pub const LTE_M_Indication_LTE_M_Indication_lte_m: LTE_M_Indication = 0;
pub type LTE_M_Indication = ::std::os::raw::c_uint;
pub use self::LTE_M_Indication as e_LTE_M_Indication;
pub type LTE_M_Indication_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_DEF_LTE_M_Indication: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn LTE_M_Indication_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LTE_M_Indication_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type TBCD_STRING_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_TBCD_STRING_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_TBCD_STRING: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn TBCD_STRING_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TBCD_STRING_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TBCD_STRING_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TBCD_STRING_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type PLMNidentity_t = TBCD_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_PLMNidentity_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_PLMNidentity: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn PLMNidentity_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn PLMNidentity_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn PLMNidentity_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn PLMNidentity_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type LAC_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_LAC_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_LAC: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn LAC_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn LAC_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LAC_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LAC_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LAC_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LAC_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LAC_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LAC_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LAC_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn LAC_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn LAC_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type CI_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_CI_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_CI: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn CI_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn CI_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CI_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CI_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CI_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CI_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CI_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CI_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CI_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn CI_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn CI_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type RAC_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_RAC_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_RAC: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn RAC_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn RAC_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn RAC_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn RAC_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn RAC_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn RAC_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn RAC_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn RAC_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn RAC_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn RAC_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn RAC_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolExtensionContainer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CGI {
    pub pLMNidentity: PLMNidentity_t,
    pub lAC: LAC_t,
    pub cI: CI_t,
    pub rAC: *mut RAC_t,
    pub iE_Extensions: *mut ProtocolExtensionContainer,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CGI"][::std::mem::size_of::<CGI>() - 160usize];
    ["Alignment of CGI"][::std::mem::align_of::<CGI>() - 8usize];
    ["Offset of field: CGI::pLMNidentity"][::std::mem::offset_of!(CGI, pLMNidentity) - 0usize];
    ["Offset of field: CGI::lAC"][::std::mem::offset_of!(CGI, lAC) - 40usize];
    ["Offset of field: CGI::cI"][::std::mem::offset_of!(CGI, cI) - 80usize];
    ["Offset of field: CGI::rAC"][::std::mem::offset_of!(CGI, rAC) - 120usize];
    ["Offset of field: CGI::iE_Extensions"][::std::mem::offset_of!(CGI, iE_Extensions) - 128usize];
    ["Offset of field: CGI::_asn_ctx"][::std::mem::offset_of!(CGI, _asn_ctx) - 136usize];
};
pub type CGI_t = CGI;
unsafe extern "C" {
    pub static mut asn_DEF_CGI: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_CGI_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_CGI_1: [asn_TYPE_member_t; 5usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolExtensionField {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolExtensionContainer_8194P0 {
    pub list: ProtocolExtensionContainer_8194P0__bindgen_ty_1,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProtocolExtensionContainer_8194P0__bindgen_ty_1 {
    pub array: *mut *mut ProtocolExtensionField,
    pub count: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ProtocolExtensionField)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolExtensionContainer_8194P0__bindgen_ty_1"]
        [::std::mem::size_of::<ProtocolExtensionContainer_8194P0__bindgen_ty_1>() - 24usize];
    ["Alignment of ProtocolExtensionContainer_8194P0__bindgen_ty_1"]
        [::std::mem::align_of::<ProtocolExtensionContainer_8194P0__bindgen_ty_1>() - 8usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0__bindgen_ty_1::array"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0__bindgen_ty_1, array) - 0usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0__bindgen_ty_1::count"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0__bindgen_ty_1, count) - 8usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0__bindgen_ty_1::size"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0__bindgen_ty_1, size) - 12usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0__bindgen_ty_1::free"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0__bindgen_ty_1, free) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolExtensionContainer_8194P0"]
        [::std::mem::size_of::<ProtocolExtensionContainer_8194P0>() - 48usize];
    ["Alignment of ProtocolExtensionContainer_8194P0"]
        [::std::mem::align_of::<ProtocolExtensionContainer_8194P0>() - 8usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0::list"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0, list) - 0usize];
    ["Offset of field: ProtocolExtensionContainer_8194P0::_asn_ctx"]
        [::std::mem::offset_of!(ProtocolExtensionContainer_8194P0, _asn_ctx) - 24usize];
};
pub type ProtocolExtensionContainer_8194P0_t = ProtocolExtensionContainer_8194P0;
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolExtensionContainer_8194P0: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ProtocolExtensionContainer_8194P0_specs_1: asn_SET_OF_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ProtocolExtensionContainer_8194P0_1: [asn_TYPE_member_t; 1usize];
}
unsafe extern "C" {
    pub static mut asn_PER_type_ProtocolExtensionContainer_8194P0_constr_1: asn_per_constraints_t;
}
pub type ProtocolExtensionID_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_ProtocolExtensionID_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolExtensionID: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProtocolExtensionID_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub const ProtocolExtensionField_8197P0__extensionValue_PR_ProtocolExtensionField_8197P0__extensionValue_PR_NOTHING : ProtocolExtensionField_8197P0__extensionValue_PR = 0 ;
pub type ProtocolExtensionField_8197P0__extensionValue_PR = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ProtocolExtensionField_8197P0 {
    pub id: ProtocolExtensionID_t,
    pub criticality: Criticality_t,
    pub extensionValue: ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue { pub present : ProtocolExtensionField_8197P0__extensionValue_PR , pub choice : ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u , pub _asn_ctx : asn_struct_ctx_t , }
#[repr(C)]
#[repr(align(1))]
#[derive(Copy, Clone)]
pub struct ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u
{
    pub bindgen_union_field: [u8; 0usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u"] [:: std :: mem :: size_of :: < ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u > () - 0usize] ;
    ["Alignment of ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u"] [:: std :: mem :: align_of :: < ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue_ProtocolExtensionField_8197P0__extensionValue_u > () - 1usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue"]
        [::std::mem::size_of::<
            ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue,
        >() - 32usize];
    ["Alignment of ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue"]
        [::std::mem::align_of::<
            ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue,
        >() - 8usize];
    ["Offset of field: ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue::present"] [:: std :: mem :: offset_of ! (ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue , present) - 0usize] ;
    ["Offset of field: ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue::choice"] [:: std :: mem :: offset_of ! (ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue , choice) - 4usize] ;
    ["Offset of field: ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue::_asn_ctx"] [:: std :: mem :: offset_of ! (ProtocolExtensionField_8197P0_ProtocolExtensionField_8197P0__extensionValue , _asn_ctx) - 8usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProtocolExtensionField_8197P0"]
        [::std::mem::size_of::<ProtocolExtensionField_8197P0>() - 72usize];
    ["Alignment of ProtocolExtensionField_8197P0"]
        [::std::mem::align_of::<ProtocolExtensionField_8197P0>() - 8usize];
    ["Offset of field: ProtocolExtensionField_8197P0::id"]
        [::std::mem::offset_of!(ProtocolExtensionField_8197P0, id) - 0usize];
    ["Offset of field: ProtocolExtensionField_8197P0::criticality"]
        [::std::mem::offset_of!(ProtocolExtensionField_8197P0, criticality) - 8usize];
    ["Offset of field: ProtocolExtensionField_8197P0::extensionValue"]
        [::std::mem::offset_of!(ProtocolExtensionField_8197P0, extensionValue) - 16usize];
    ["Offset of field: ProtocolExtensionField_8197P0::_asn_ctx"]
        [::std::mem::offset_of!(ProtocolExtensionField_8197P0, _asn_ctx) - 48usize];
};
pub type ProtocolExtensionField_8197P0_t = ProtocolExtensionField_8197P0;
unsafe extern "C" {
    pub static mut asn_DEF_ProtocolExtensionField_8197P0: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_ProtocolExtensionField_8197P0_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_ProtocolExtensionField_8197P0_1: [asn_TYPE_member_t; 3usize];
}
pub const BluetoothMeasConfig_BluetoothMeasConfig_setup: BluetoothMeasConfig = 0;
pub type BluetoothMeasConfig = ::std::os::raw::c_uint;
pub use self::BluetoothMeasConfig as e_BluetoothMeasConfig;
pub type BluetoothMeasConfig_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_BluetoothMeasConfig_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_BluetoothMeasConfig: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static asn_SPC_BluetoothMeasConfig_specs_1: asn_INTEGER_specifics_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BluetoothMeasConfig_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type TAC_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_TAC_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_TAC: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn TAC_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn TAC_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TAC_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TAC_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TAC_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TAC_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TAC_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TAC_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TAC_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn TAC_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn TAC_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub type MSClassmark3_t = OCTET_STRING_t;
unsafe extern "C" {
    pub static mut asn_DEF_MSClassmark3: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn MSClassmark3_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MSClassmark3_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn MSClassmark3_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn MSClassmark3_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BIT_STRING_s {
    pub buf: *mut u8,
    pub size: usize,
    pub bits_unused: ::std::os::raw::c_int,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BIT_STRING_s"][::std::mem::size_of::<BIT_STRING_s>() - 48usize];
    ["Alignment of BIT_STRING_s"][::std::mem::align_of::<BIT_STRING_s>() - 8usize];
    ["Offset of field: BIT_STRING_s::buf"][::std::mem::offset_of!(BIT_STRING_s, buf) - 0usize];
    ["Offset of field: BIT_STRING_s::size"][::std::mem::offset_of!(BIT_STRING_s, size) - 8usize];
    ["Offset of field: BIT_STRING_s::bits_unused"]
        [::std::mem::offset_of!(BIT_STRING_s, bits_unused) - 16usize];
    ["Offset of field: BIT_STRING_s::_asn_ctx"]
        [::std::mem::offset_of!(BIT_STRING_s, _asn_ctx) - 24usize];
};
pub type BIT_STRING_t = BIT_STRING_s;
unsafe extern "C" {
    pub static mut asn_DEF_BIT_STRING: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_OP_BIT_STRING: asn_TYPE_operation_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_BIT_STRING_specs: asn_OCTET_STRING_specifics_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIT_STRING_compare(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_A: *const ::std::os::raw::c_void,
        struct_B: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIT_STRING_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIT_STRING_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn BIT_STRING_random_fill(
        td: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        memb_constraints: *const asn_encoding_constraints_s,
        max_length: usize,
    ) -> asn_random_fill_result_t;
}
pub type NRCellIdentity_t = BIT_STRING_t;
unsafe extern "C" {
    pub static mut asn_PER_type_NRCellIdentity_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_NRCellIdentity: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn NRCellIdentity_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn NRCellIdentity_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn NRCellIdentity_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn NRCellIdentity_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NR_CGI {
    pub pLMNIdentity: PLMNidentity_t,
    pub nRCellIdentity: NRCellIdentity_t,
    pub iE_Extensions: *mut ProtocolExtensionContainer,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NR_CGI"][::std::mem::size_of::<NR_CGI>() - 120usize];
    ["Alignment of NR_CGI"][::std::mem::align_of::<NR_CGI>() - 8usize];
    ["Offset of field: NR_CGI::pLMNIdentity"]
        [::std::mem::offset_of!(NR_CGI, pLMNIdentity) - 0usize];
    ["Offset of field: NR_CGI::nRCellIdentity"]
        [::std::mem::offset_of!(NR_CGI, nRCellIdentity) - 40usize];
    ["Offset of field: NR_CGI::iE_Extensions"]
        [::std::mem::offset_of!(NR_CGI, iE_Extensions) - 88usize];
    ["Offset of field: NR_CGI::_asn_ctx"][::std::mem::offset_of!(NR_CGI, _asn_ctx) - 96usize];
};
pub type NR_CGI_t = NR_CGI;
unsafe extern "C" {
    pub static mut asn_DEF_NR_CGI: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_NR_CGI_specs_1: asn_SEQUENCE_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_NR_CGI_1: [asn_TYPE_member_t; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TACList_In_LTE_NTN {
    pub list: TACList_In_LTE_NTN__bindgen_ty_1,
    pub _asn_ctx: asn_struct_ctx_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TACList_In_LTE_NTN__bindgen_ty_1 {
    pub array: *mut *mut TAC_t,
    pub count: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut TAC_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TACList_In_LTE_NTN__bindgen_ty_1"]
        [::std::mem::size_of::<TACList_In_LTE_NTN__bindgen_ty_1>() - 24usize];
    ["Alignment of TACList_In_LTE_NTN__bindgen_ty_1"]
        [::std::mem::align_of::<TACList_In_LTE_NTN__bindgen_ty_1>() - 8usize];
    ["Offset of field: TACList_In_LTE_NTN__bindgen_ty_1::array"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN__bindgen_ty_1, array) - 0usize];
    ["Offset of field: TACList_In_LTE_NTN__bindgen_ty_1::count"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN__bindgen_ty_1, count) - 8usize];
    ["Offset of field: TACList_In_LTE_NTN__bindgen_ty_1::size"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN__bindgen_ty_1, size) - 12usize];
    ["Offset of field: TACList_In_LTE_NTN__bindgen_ty_1::free"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN__bindgen_ty_1, free) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TACList_In_LTE_NTN"][::std::mem::size_of::<TACList_In_LTE_NTN>() - 48usize];
    ["Alignment of TACList_In_LTE_NTN"][::std::mem::align_of::<TACList_In_LTE_NTN>() - 8usize];
    ["Offset of field: TACList_In_LTE_NTN::list"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN, list) - 0usize];
    ["Offset of field: TACList_In_LTE_NTN::_asn_ctx"]
        [::std::mem::offset_of!(TACList_In_LTE_NTN, _asn_ctx) - 24usize];
};
pub type TACList_In_LTE_NTN_t = TACList_In_LTE_NTN;
unsafe extern "C" {
    pub static mut asn_DEF_TACList_In_LTE_NTN: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static mut asn_SPC_TACList_In_LTE_NTN_specs_1: asn_SET_OF_specifics_t;
}
unsafe extern "C" {
    pub static mut asn_MBR_TACList_In_LTE_NTN_1: [asn_TYPE_member_t; 1usize];
}
unsafe extern "C" {
    pub static mut asn_PER_type_TACList_In_LTE_NTN_constr_1: asn_per_constraints_t;
}
pub type ProcedureCode_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_ProcedureCode_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_ProcedureCode: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
    );
}
unsafe extern "C" {
    pub fn ProcedureCode_print(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        callback: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProcedureCode_constraint(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        optional_callback: asn_app_constraint_failed_f,
        optional_app_key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ProcedureCode_decode_ber(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
        tag_mode: ::std::os::raw::c_int,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_encode_der(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        tag_mode: ::std::os::raw::c_int,
        tag: ber_tlv_tag_t,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_decode_xer(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        opt_mname: *const ::std::os::raw::c_char,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_encode_xer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *const ::std::os::raw::c_void,
        ilevel: ::std::os::raw::c_int,
        xer_flags: xer_encoder_flags_e,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_decode_oer(
        opt_codec_ctx: *const asn_codec_ctx_s,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        buf_ptr: *const ::std::os::raw::c_void,
        size: usize,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_encode_oer(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_oer_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        consume_bytes_cb: asn_app_consume_bytes_f,
        app_key: *mut ::std::os::raw::c_void,
    ) -> asn_enc_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_decode_uper(
        opt_codec_ctx: *const asn_codec_ctx_t,
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *mut *mut ::std::os::raw::c_void,
        per_data: *mut asn_per_data_t,
    ) -> asn_dec_rval_t;
}
unsafe extern "C" {
    pub fn ProcedureCode_encode_uper(
        type_descriptor: *const asn_TYPE_descriptor_s,
        constraints: *const asn_per_constraints_t,
        struct_ptr: *const ::std::os::raw::c_void,
        per_output: *mut asn_per_outp_t,
    ) -> asn_enc_rval_t;
}
pub const IntegrityProtectionIndication_IntegrityProtectionIndication_required:
    IntegrityProtectionIndication = 0;
pub const IntegrityProtectionIndication_IntegrityProtectionIndication_preferred:
    IntegrityProtectionIndication = 1;
pub const IntegrityProtectionIndication_IntegrityProtectionIndication_not_needed:
    IntegrityProtectionIndication = 2;
pub type IntegrityProtectionIndication = ::std::os::raw::c_uint;
pub use self::IntegrityProtectionIndication as e_IntegrityProtectionIndication;
pub type IntegrityProtectionIndication_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut asn_PER_type_IntegrityProtectionIndication_constr_1: asn_per_constraints_t;
}
unsafe extern "C" {
    pub static mut asn_DEF_IntegrityProtectionIndication: asn_TYPE_descriptor_t;
}
unsafe extern "C" {
    pub static asn_SPC_IntegrityProtectionIndication_specs_1: asn_INTEGER_specifics_t;
}
unsafe extern "C" {
    pub fn IntegrityProtectionIndication_free(
        type_descriptor: *const asn_TYPE_descriptor_s,
        struct_ptr: *mut ::std::os::raw::c_void,
        arg1: asn_struct_free_method,
